podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MKE14D7.h
/* FTM1 - Peripheral instance base addresses */
#define FTM1_BasePtr                   0x4002A000UL //!< Peripheral base address
#define FTM1                           ((FTM1_Type *) FTM1_BasePtr) //!< Freescale base pointer
#define FTM1_BASE_PTR                  (FTM1) //!< Freescale style base pointer
/**
 * @} */ /* End group FTM_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup FTM_Peripheral_access_layer_GROUP FTM Peripheral Access Layer
* @brief C Struct for FTM
* @{
*/

/* ================================================================================ */
/* ================           FTM2 (derived from FTM1)             ================ */
/* ================================================================================ */

/**
 * @brief FlexTimer Module (2 channels)
 */

/* FTM2 - Peripheral instance base addresses */
#define FTM2_BasePtr                   0x4002B000UL //!< Peripheral base address
#define FTM2                           ((FTM1_Type *) FTM2_BasePtr) //!< Freescale base pointer
#define FTM2_BASE_PTR                  (FTM2) //!< Freescale style base pointer
/**
 * @} */ /* End group FTM_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup FTM_Peripheral_access_layer_GROUP FTM Peripheral Access Layer
* @brief C Struct for FTM
* @{
*/

/* ================================================================================ */
/* ================           FTM3 (derived from FTM0)             ================ */
/* ================================================================================ */

/**
 * @brief FlexTimer Module (6 channels)
 */

/* FTM3 - Peripheral instance base addresses */
#define FTM3_BasePtr                   0x4002C000UL //!< Peripheral base address
#define FTM3                           ((FTM_Type *) FTM3_BasePtr) //!< Freescale base pointer
#define FTM3_BASE_PTR                  (FTM3) //!< Freescale style base pointer
/**
 * @} */ /* End group FTM_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup FTMRA_Peripheral_access_layer_GROUP FTMRA Peripheral Access Layer
* @brief C Struct for FTMRA
* @{
*/

/* ================================================================================ */
/* ================           FTMRA (file:FTMRA)                   ================ */
/* ================================================================================ */

/**
 * @brief FTMRA Family Flash Module
 */
/**
* @addtogroup FTMRA_structs_GROUP FTMRA struct
* @brief Struct for FTMRA
* @{
*/
typedef struct {                                /*       FTMRA Structure                                              */
   __I  uint8_t   FSEC;                         /**< 0000: Flash Security Register                                      */
   __IO uint8_t   FCLKDIV;                      /**< 0001: Flash Clock Divider Register                                 */
   __IO uint8_t   FECCRIX;                      /**< 0002: Flash ECCR Index Register                                    */
   __IO uint8_t   FCCOBIX;                      /**< 0003: Flash Common Command Object Index Register                   */
   __IO uint8_t   FERCNFG;                      /**< 0004: Flash Error Configuration Register                           */
   __IO uint8_t   FCNFG;                        /**< 0005: Flash Configuration Register                                 */
   __IO uint8_t   FERSTAT;                      /**< 0006: Flash Error Status Register                                  */
   __IO uint8_t   FSTAT;                        /**< 0007: Flash Status Register                                        */
   __IO uint8_t   DFPROT;                       /**< 0008: D-Flash Protection Register                                  */
   __IO uint8_t   FPROT;                        /**< 0009: P-Flash Protection Register                                  */
   __IO uint8_t   FCCOBLO;                      /**< 000A: Flash Common Command Object Low Register                     */
   __IO uint8_t   FCCOBHI;                      /**< 000B: Flash Common Command Object High Register                    */
   __I  uint16_t  RESERVED0;                   
   __I  uint8_t   FECCRLO;                      /**< 000E: Flash ECC Error Results Low Register                         */
   __I  uint8_t   FECCRHI;                      /**< 000F: Flash ECC Error Results High Register                        */
   __I  uint8_t   RESERVED1;                   
   __I  uint8_t   FOPT;                         /**< 0011: Flash Option Register                                        */
} FTMRA_Type;

/**
 * @} */ /* End group FTMRA_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'FTMRA' Position & Mask macros                       ----------- */
/* -------------------------------------------------------------------------------- */

/**
* @addtogroup FTMRA_Register_Masks_GROUP FTMRA Register Masks
* @brief Register Masks for FTMRA
* @{
*/
/* ------- FSEC Bit Fields                          ------ */
#define FTMRA_FSEC_SEC_MASK                      (0x03UL << FTMRA_FSEC_SEC_SHIFT)                    /*!< FTMRA_FSEC: SEC Mask                    */
#define FTMRA_FSEC_SEC_SHIFT                     0                                                   /*!< FTMRA_FSEC: SEC Position                */
#define FTMRA_FSEC_SEC(x)                        (((uint8_t)(((uint8_t)(x))<<FTMRA_FSEC_SEC_SHIFT))&FTMRA_FSEC_SEC_MASK) /*!< FTMRA_FSEC                              */
#define FTMRA_FSEC_RNV_MASK                      (0x0FUL << FTMRA_FSEC_RNV_SHIFT)                    /*!< FTMRA_FSEC: RNV Mask                    */
#define FTMRA_FSEC_RNV_SHIFT                     2                                                   /*!< FTMRA_FSEC: RNV Position                */
#define FTMRA_FSEC_RNV(x)                        (((uint8_t)(((uint8_t)(x))<<FTMRA_FSEC_RNV_SHIFT))&FTMRA_FSEC_RNV_MASK) /*!< FTMRA_FSEC                              */
#define FTMRA_FSEC_KEYEN_MASK                    (0x03UL << FTMRA_FSEC_KEYEN_SHIFT)                  /*!< FTMRA_FSEC: KEYEN Mask                  */
#define FTMRA_FSEC_KEYEN_SHIFT                   6                                                   /*!< FTMRA_FSEC: KEYEN Position              */
#define FTMRA_FSEC_KEYEN(x)                      (((uint8_t)(((uint8_t)(x))<<FTMRA_FSEC_KEYEN_SHIFT))&FTMRA_FSEC_KEYEN_MASK) /*!< FTMRA_FSEC                              */
/* ------- FCLKDIV Bit Fields                       ------ */
#define FTMRA_FCLKDIV_FDIV_MASK                  (0x7FUL << FTMRA_FCLKDIV_FDIV_SHIFT)                /*!< FTMRA_FCLKDIV: FDIV Mask                */
#define FTMRA_FCLKDIV_FDIV_SHIFT                 0                                                   /*!< FTMRA_FCLKDIV: FDIV Position            */
#define FTMRA_FCLKDIV_FDIV(x)                    (((uint8_t)(((uint8_t)(x))<<FTMRA_FCLKDIV_FDIV_SHIFT))&FTMRA_FCLKDIV_FDIV_MASK) /*!< FTMRA_FCLKDIV                           */
#define FTMRA_FCLKDIV_FDIVLD_MASK                (0x01UL << FTMRA_FCLKDIV_FDIVLD_SHIFT)              /*!< FTMRA_FCLKDIV: FDIVLD Mask              */
#define FTMRA_FCLKDIV_FDIVLD_SHIFT               7                                                   /*!< FTMRA_FCLKDIV: FDIVLD Position          */
/* ------- FECCRIX Bit Fields                       ------ */
#define FTMRA_FECCRIX_ECCRIX_MASK                (0x07UL << FTMRA_FECCRIX_ECCRIX_SHIFT)              /*!< FTMRA_FECCRIX: ECCRIX Mask              */
#define FTMRA_FECCRIX_ECCRIX_SHIFT               0                                                   /*!< FTMRA_FECCRIX: ECCRIX Position          */
#define FTMRA_FECCRIX_ECCRIX(x)                  (((uint8_t)(((uint8_t)(x))<<FTMRA_FECCRIX_ECCRIX_SHIFT))&FTMRA_FECCRIX_ECCRIX_MASK) /*!< FTMRA_FECCRIX                           */
/* ------- FCCOBIX Bit Fields                       ------ */
#define FTMRA_FCCOBIX_CCOBIX_MASK                (0x07UL << FTMRA_FCCOBIX_CCOBIX_SHIFT)              /*!< FTMRA_FCCOBIX: CCOBIX Mask              */
#define FTMRA_FCCOBIX_CCOBIX_SHIFT               0                                                   /*!< FTMRA_FCCOBIX: CCOBIX Position          */
#define FTMRA_FCCOBIX_CCOBIX(x)                  (((uint8_t)(((uint8_t)(x))<<FTMRA_FCCOBIX_CCOBIX_SHIFT))&FTMRA_FCCOBIX_CCOBIX_MASK) /*!< FTMRA_FCCOBIX                           */
/* ------- FERCNFG Bit Fields                       ------ */
#define FTMRA_FERCNFG_SFDIE_MASK                 (0x01UL << FTMRA_FERCNFG_SFDIE_SHIFT)               /*!< FTMRA_FERCNFG: SFDIE Mask               */
#define FTMRA_FERCNFG_SFDIE_SHIFT                0                                                   /*!< FTMRA_FERCNFG: SFDIE Position           */
#define FTMRA_FERCNFG_DFDIE_MASK                 (0x01UL << FTMRA_FERCNFG_DFDIE_SHIFT)               /*!< FTMRA_FERCNFG: DFDIE Mask               */
#define FTMRA_FERCNFG_DFDIE_SHIFT                1                                                   /*!< FTMRA_FERCNFG: DFDIE Position           */
/* ------- FCNFG Bit Fields                         ------ */
#define FTMRA_FCNFG_FSFD_MASK                    (0x01UL << FTMRA_FCNFG_FSFD_SHIFT)                  /*!< FTMRA_FCNFG: FSFD Mask                  */
#define FTMRA_FCNFG_FSFD_SHIFT                   0                                                   /*!< FTMRA_FCNFG: FSFD Position              */
#define FTMRA_FCNFG_FDFD_MASK                    (0x01UL << FTMRA_FCNFG_FDFD_SHIFT)                  /*!< FTMRA_FCNFG: FDFD Mask                  */
#define FTMRA_FCNFG_FDFD_SHIFT                   1                                                   /*!< FTMRA_FCNFG: FDFD Position              */
#define FTMRA_FCNFG_IGNSF_MASK                   (0x01UL << FTMRA_FCNFG_IGNSF_SHIFT)                 /*!< FTMRA_FCNFG: IGNSF Mask                 */
#define FTMRA_FCNFG_IGNSF_SHIFT                  4                                                   /*!< FTMRA_FCNFG: IGNSF Position             */
#define FTMRA_FCNFG_ERSAREQ_MASK                 (0x01UL << FTMRA_FCNFG_ERSAREQ_SHIFT)               /*!< FTMRA_FCNFG: ERSAREQ Mask               */
#define FTMRA_FCNFG_ERSAREQ_SHIFT                5                                                   /*!< FTMRA_FCNFG: ERSAREQ Position           */
#define FTMRA_FCNFG_CCIE_MASK                    (0x01UL << FTMRA_FCNFG_CCIE_SHIFT)                  /*!< FTMRA_FCNFG: CCIE Mask                  */
#define FTMRA_FCNFG_CCIE_SHIFT                   7                                                   /*!< FTMRA_FCNFG: CCIE Position              */
/* ------- FERSTAT Bit Fields                       ------ */
#define FTMRA_FERSTAT_SFDIF_MASK                 (0x01UL << FTMRA_FERSTAT_SFDIF_SHIFT)               /*!< FTMRA_FERSTAT: SFDIF Mask               */
#define FTMRA_FERSTAT_SFDIF_SHIFT                0                                                   /*!< FTMRA_FERSTAT: SFDIF Position           */
#define FTMRA_FERSTAT_DFDIF_MASK                 (0x01UL << FTMRA_FERSTAT_DFDIF_SHIFT)               /*!< FTMRA_FERSTAT: DFDIF Mask               */
#define FTMRA_FERSTAT_DFDIF_SHIFT                1                                                   /*!< FTMRA_FERSTAT: DFDIF Position           */
/* ------- FSTAT Bit Fields                         ------ */
#define FTMRA_FSTAT_MGSTAT_MASK                  (0x03UL << FTMRA_FSTAT_MGSTAT_SHIFT)                /*!< FTMRA_FSTAT: MGSTAT Mask                */
#define FTMRA_FSTAT_MGSTAT_SHIFT                 0                                                   /*!< FTMRA_FSTAT: MGSTAT Position            */
#define FTMRA_FSTAT_MGSTAT(x)                    (((uint8_t)(((uint8_t)(x))<<FTMRA_FSTAT_MGSTAT_SHIFT))&FTMRA_FSTAT_MGSTAT_MASK) /*!< FTMRA_FSTAT                             */
#define FTMRA_FSTAT_MGBUSY_MASK                  (0x01UL << FTMRA_FSTAT_MGBUSY_SHIFT)                /*!< FTMRA_FSTAT: MGBUSY Mask                */
#define FTMRA_FSTAT_MGBUSY_SHIFT                 3                                                   /*!< FTMRA_FSTAT: MGBUSY Position            */
#define FTMRA_FSTAT_FPVIOL_MASK                  (0x01UL << FTMRA_FSTAT_FPVIOL_SHIFT)                /*!< FTMRA_FSTAT: FPVIOL Mask                */
#define FTMRA_FSTAT_FPVIOL_SHIFT                 4                                                   /*!< FTMRA_FSTAT: FPVIOL Position            */
#define FTMRA_FSTAT_ACCERR_MASK                  (0x01UL << FTMRA_FSTAT_ACCERR_SHIFT)                /*!< FTMRA_FSTAT: ACCERR Mask                */
#define FTMRA_FSTAT_ACCERR_SHIFT                 5                                                   /*!< FTMRA_FSTAT: ACCERR Position            */
#define FTMRA_FSTAT_CCIF_MASK                    (0x01UL << FTMRA_FSTAT_CCIF_SHIFT)                  /*!< FTMRA_FSTAT: CCIF Mask                  */
#define FTMRA_FSTAT_CCIF_SHIFT                   7                                                   /*!< FTMRA_FSTAT: CCIF Position              */
/* ------- DFPROT Bit Fields                        ------ */
#define FTMRA_DFPROT_DPS_MASK                    (0x1FUL << FTMRA_DFPROT_DPS_SHIFT)                  /*!< FTMRA_DFPROT: DPS Mask                  */
#define FTMRA_DFPROT_DPS_SHIFT                   0                                                   /*!< FTMRA_DFPROT: DPS Position              */
#define FTMRA_DFPROT_DPS(x)                      (((uint8_t)(((uint8_t)(x))<<FTMRA_DFPROT_DPS_SHIFT))&FTMRA_DFPROT_DPS_MASK) /*!< FTMRA_DFPROT                            */
#define FTMRA_DFPROT_DPOPEN_MASK                 (0x01UL << FTMRA_DFPROT_DPOPEN_SHIFT)               /*!< FTMRA_DFPROT: DPOPEN Mask               */
#define FTMRA_DFPROT_DPOPEN_SHIFT                7                                                   /*!< FTMRA_DFPROT: DPOPEN Position           */
/* ------- FPROT Bit Fields                         ------ */
#define FTMRA_FPROT_FPLS_MASK                    (0x03UL << FTMRA_FPROT_FPLS_SHIFT)                  /*!< FTMRA_FPROT: FPLS Mask                  */
#define FTMRA_FPROT_FPLS_SHIFT                   0                                                   /*!< FTMRA_FPROT: FPLS Position              */
#define FTMRA_FPROT_FPLS(x)                      (((uint8_t)(((uint8_t)(x))<<FTMRA_FPROT_FPLS_SHIFT))&FTMRA_FPROT_FPLS_MASK) /*!< FTMRA_FPROT                             */
#define FTMRA_FPROT_FPLDIS_MASK                  (0x01UL << FTMRA_FPROT_FPLDIS_SHIFT)                /*!< FTMRA_FPROT: FPLDIS Mask                */
#define FTMRA_FPROT_FPLDIS_SHIFT                 2                                                   /*!< FTMRA_FPROT: FPLDIS Position            */
#define FTMRA_FPROT_FPHS_MASK                    (0x03UL << FTMRA_FPROT_FPHS_SHIFT)                  /*!< FTMRA_FPROT: FPHS Mask                  */
#define FTMRA_FPROT_FPHS_SHIFT                   3                                                   /*!< FTMRA_FPROT: FPHS Position              */
#define FTMRA_FPROT_FPHS(x)                      (((uint8_t)(((uint8_t)(x))<<FTMRA_FPROT_FPHS_SHIFT))&FTMRA_FPROT_FPHS_MASK) /*!< FTMRA_FPROT                             */
#define FTMRA_FPROT_FPHDIS_MASK                  (0x01UL << FTMRA_FPROT_FPHDIS_SHIFT)                /*!< FTMRA_FPROT: FPHDIS Mask                */
#define FTMRA_FPROT_FPHDIS_SHIFT                 5                                                   /*!< FTMRA_FPROT: FPHDIS Position            */
#define FTMRA_FPROT_RNV_MASK                     (0x01UL << FTMRA_FPROT_RNV_SHIFT)                   /*!< FTMRA_FPROT: RNV Mask                   */
#define FTMRA_FPROT_RNV_SHIFT                    6                                                   /*!< FTMRA_FPROT: RNV Position               */
#define FTMRA_FPROT_FPOPEN_MASK                  (0x01UL << FTMRA_FPROT_FPOPEN_SHIFT)                /*!< FTMRA_FPROT: FPOPEN Mask                */
#define FTMRA_FPROT_FPOPEN_SHIFT                 7                                                   /*!< FTMRA_FPROT: FPOPEN Position            */
/* ------- FCCOBLO Bit Fields                       ------ */
#define FTMRA_FCCOBLO_CCOBn_MASK                 (0xFFUL << FTMRA_FCCOBLO_CCOBn_SHIFT)               /*!< FTMRA_FCCOBLO: CCOBn Mask               */
#define FTMRA_FCCOBLO_CCOBn_SHIFT                0                                                   /*!< FTMRA_FCCOBLO: CCOBn Position           */
#define FTMRA_FCCOBLO_CCOBn(x)                   (((uint8_t)(((uint8_t)(x))<<FTMRA_FCCOBLO_CCOBn_SHIFT))&FTMRA_FCCOBLO_CCOBn_MASK) /*!< FTMRA_FCCOBLO                           */
/* ------- FCCOBHI Bit Fields                       ------ */
#define FTMRA_FCCOBHI_CCOBn_MASK                 (0xFFUL << FTMRA_FCCOBHI_CCOBn_SHIFT)               /*!< FTMRA_FCCOBHI: CCOBn Mask               */
#define FTMRA_FCCOBHI_CCOBn_SHIFT                0                                                   /*!< FTMRA_FCCOBHI: CCOBn Position           */
#define FTMRA_FCCOBHI_CCOBn(x)                   (((uint8_t)(((uint8_t)(x))<<FTMRA_FCCOBHI_CCOBn_SHIFT))&FTMRA_FCCOBHI_CCOBn_MASK) /*!< FTMRA_FCCOBHI                           */
/* ------- FECCRLO Bit Fields                       ------ */
#define FTMRA_FECCRLO_ECCR_MASK                  (0xFFUL << FTMRA_FECCRLO_ECCR_SHIFT)                /*!< FTMRA_FECCRLO: ECCR Mask                */
#define FTMRA_FECCRLO_ECCR_SHIFT                 0                                                   /*!< FTMRA_FECCRLO: ECCR Position            */
#define FTMRA_FECCRLO_ECCR(x)                    (((uint8_t)(((uint8_t)(x))<<FTMRA_FECCRLO_ECCR_SHIFT))&FTMRA_FECCRLO_ECCR_MASK) /*!< FTMRA_FECCRLO                           */
/* ------- FECCRHI Bit Fields                       ------ */
#define FTMRA_FECCRHI_ECCR_MASK                  (0xFFUL << FTMRA_FECCRHI_ECCR_SHIFT)                /*!< FTMRA_FECCRHI: ECCR Mask                */
#define FTMRA_FECCRHI_ECCR_SHIFT                 0                                                   /*!< FTMRA_FECCRHI: ECCR Position            */
#define FTMRA_FECCRHI_ECCR(x)                    (((uint8_t)(((uint8_t)(x))<<FTMRA_FECCRHI_ECCR_SHIFT))&FTMRA_FECCRHI_ECCR_MASK) /*!< FTMRA_FECCRHI                           */
/* ------- FOPT Bit Fields                          ------ */
#define FTMRA_FOPT_NV_MASK                       (0xFFUL << FTMRA_FOPT_NV_SHIFT)                     /*!< FTMRA_FOPT: NV Mask                     */
#define FTMRA_FOPT_NV_SHIFT                      0                                                   /*!< FTMRA_FOPT: NV Position                 */
#define FTMRA_FOPT_NV(x)                         (((uint8_t)(((uint8_t)(x))<<FTMRA_FOPT_NV_SHIFT))&FTMRA_FOPT_NV_MASK) /*!< FTMRA_FOPT                              */
/**
 * @} */ /* End group FTMRA_Register_Masks_GROUP 
 */

/* FTMRA - Peripheral instance base addresses */
#define FTMRA_BasePtr                  0x40039000UL //!< Peripheral base address
#define FTMRA                          ((FTMRA_Type *) FTMRA_BasePtr) //!< Freescale base pointer
#define FTMRA_BASE_PTR                 (FTMRA) //!< Freescale style base pointer
/**
 * @} */ /* End group FTMRA_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup GPIOA_Peripheral_access_layer_GROUP GPIOA Peripheral Access Layer
* @brief C Struct for GPIOA
* @{
*/

/* ================================================================================ */
/* ================           GPIOA (file:GPIOA_0x4007F000)        ================ */
/* ================================================================================ */

/**
 * @brief General Purpose Input/Output
 */
/**
* @addtogroup GPIOA_structs_GROUP GPIOA struct
* @brief Struct for GPIOA
* @{
*/
typedef struct {                                /*       GPIOA Structure                                              */
   __IO uint32_t  PDOR;                         /**< 0000: Port Data Output Register                                    */
   __O  uint32_t  PSOR;                         /**< 0004: Port Set Output Register                                     */
   __O  uint32_t  PCOR;                         /**< 0008: Port Clear Output Register                                   */
   __O  uint32_t  PTOR;                         /**< 000C: Port Toggle Output Register                                  */
   __I  uint32_t  PDIR;                         /**< 0010: Port Data Input Register                                     */
   __IO uint32_t  PDDR;                         /**< 0014: Port Data Direction Register                                 */
} GPIO_Type;

/**
 * @} */ /* End group GPIOA_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'GPIOA' Position & Mask macros                       ----------- */
/* -------------------------------------------------------------------------------- */

/**
* @addtogroup GPIOA_Register_Masks_GROUP GPIOA Register Masks
* @brief Register Masks for GPIOA
* @{
*/
/* ------- PDOR Bit Fields                          ------ */
/* ------- PSOR Bit Fields                          ------ */
/* ------- PCOR Bit Fields                          ------ */
/* ------- PTOR Bit Fields                          ------ */
/* ------- PDIR Bit Fields                          ------ */
/* ------- PDDR Bit Fields                          ------ */
/**
 * @} */ /* End group GPIOA_Register_Masks_GROUP 
 */

/* GPIOA - Peripheral instance base addresses */
#define GPIOA_BasePtr                  0x4007F000UL //!< Peripheral base address
#define GPIOA                          ((GPIO_Type *) GPIOA_BasePtr) //!< Freescale base pointer
#define GPIOA_BASE_PTR                 (GPIOA) //!< Freescale style base pointer
/**
 * @} */ /* End group GPIOA_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup GPIOA_Peripheral_access_layer_GROUP GPIOA Peripheral Access Layer
* @brief C Struct for GPIOA
* @{
*/

/* ================================================================================ */
/* ================           GPIOB (derived from GPIOA)           ================ */
/* ================================================================================ */

/**
 * @brief General Purpose Input/Output
 */

/* GPIOB - Peripheral instance base addresses */
#define GPIOB_BasePtr                  0x4007F040UL //!< Peripheral base address
#define GPIOB                          ((GPIO_Type *) GPIOB_BasePtr) //!< Freescale base pointer
#define GPIOB_BASE_PTR                 (GPIOB) //!< Freescale style base pointer
/**
 * @} */ /* End group GPIOA_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup GPIOA_Peripheral_access_layer_GROUP GPIOA Peripheral Access Layer
* @brief C Struct for GPIOA
* @{
*/

/* ================================================================================ */
/* ================           GPIOC (derived from GPIOA)           ================ */
/* ================================================================================ */

/**
 * @brief General Purpose Input/Output
 */

