podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MKE14D7.h
/**
* @addtogroup ICS_Register_Masks_GROUP ICS Register Masks
* @brief Register Masks for ICS
* @{
*/
/* ------- C1 Bit Fields                            ------ */
#define ICS_C1_IREFSTEN_MASK                     (0x01UL << ICS_C1_IREFSTEN_SHIFT)                   /*!< ICS_C1: IREFSTEN Mask                   */
#define ICS_C1_IREFSTEN_SHIFT                    0                                                   /*!< ICS_C1: IREFSTEN Position               */
#define ICS_C1_IRCLKEN_MASK                      (0x01UL << ICS_C1_IRCLKEN_SHIFT)                    /*!< ICS_C1: IRCLKEN Mask                    */
#define ICS_C1_IRCLKEN_SHIFT                     1                                                   /*!< ICS_C1: IRCLKEN Position                */
#define ICS_C1_IREFS_MASK                        (0x01UL << ICS_C1_IREFS_SHIFT)                      /*!< ICS_C1: IREFS Mask                      */
#define ICS_C1_IREFS_SHIFT                       2                                                   /*!< ICS_C1: IREFS Position                  */
#define ICS_C1_RDIV_MASK                         (0x07UL << ICS_C1_RDIV_SHIFT)                       /*!< ICS_C1: RDIV Mask                       */
#define ICS_C1_RDIV_SHIFT                        3                                                   /*!< ICS_C1: RDIV Position                   */
#define ICS_C1_RDIV(x)                           (((uint8_t)(((uint8_t)(x))<<ICS_C1_RDIV_SHIFT))&ICS_C1_RDIV_MASK) /*!< ICS_C1                                  */
#define ICS_C1_CLKS_MASK                         (0x03UL << ICS_C1_CLKS_SHIFT)                       /*!< ICS_C1: CLKS Mask                       */
#define ICS_C1_CLKS_SHIFT                        6                                                   /*!< ICS_C1: CLKS Position                   */
#define ICS_C1_CLKS(x)                           (((uint8_t)(((uint8_t)(x))<<ICS_C1_CLKS_SHIFT))&ICS_C1_CLKS_MASK) /*!< ICS_C1                                  */
/* ------- C2 Bit Fields                            ------ */
#define ICS_C2_FRDIV_MASK                        (0x03UL << ICS_C2_FRDIV_SHIFT)                      /*!< ICS_C2: FRDIV Mask                      */
#define ICS_C2_FRDIV_SHIFT                       2                                                   /*!< ICS_C2: FRDIV Position                  */
#define ICS_C2_FRDIV(x)                          (((uint8_t)(((uint8_t)(x))<<ICS_C2_FRDIV_SHIFT))&ICS_C2_FRDIV_MASK) /*!< ICS_C2                                  */
#define ICS_C2_LP_MASK                           (0x01UL << ICS_C2_LP_SHIFT)                         /*!< ICS_C2: LP Mask                         */
#define ICS_C2_LP_SHIFT                          4                                                   /*!< ICS_C2: LP Position                     */
#define ICS_C2_BDIV_MASK                         (0x07UL << ICS_C2_BDIV_SHIFT)                       /*!< ICS_C2: BDIV Mask                       */
#define ICS_C2_BDIV_SHIFT                        5                                                   /*!< ICS_C2: BDIV Position                   */
#define ICS_C2_BDIV(x)                           (((uint8_t)(((uint8_t)(x))<<ICS_C2_BDIV_SHIFT))&ICS_C2_BDIV_MASK) /*!< ICS_C2                                  */
/* ------- C3 Bit Fields                            ------ */
#define ICS_C3_SCTRIM_MASK                       (0xFFUL << ICS_C3_SCTRIM_SHIFT)                     /*!< ICS_C3: SCTRIM Mask                     */
#define ICS_C3_SCTRIM_SHIFT                      0                                                   /*!< ICS_C3: SCTRIM Position                 */
#define ICS_C3_SCTRIM(x)                         (((uint8_t)(((uint8_t)(x))<<ICS_C3_SCTRIM_SHIFT))&ICS_C3_SCTRIM_MASK) /*!< ICS_C3                                  */
/* ------- C4 Bit Fields                            ------ */
#define ICS_C4_SCFTRIM_MASK                      (0x01UL << ICS_C4_SCFTRIM_SHIFT)                    /*!< ICS_C4: SCFTRIM Mask                    */
#define ICS_C4_SCFTRIM_SHIFT                     0                                                   /*!< ICS_C4: SCFTRIM Position                */
#define ICS_C4_CME_MASK                          (0x01UL << ICS_C4_CME_SHIFT)                        /*!< ICS_C4: CME Mask                        */
#define ICS_C4_CME_SHIFT                         5                                                   /*!< ICS_C4: CME Position                    */
#define ICS_C4_RLOLIE_MASK                       (0x01UL << ICS_C4_RLOLIE_SHIFT)                     /*!< ICS_C4: RLOLIE Mask                     */
#define ICS_C4_RLOLIE_SHIFT                      6                                                   /*!< ICS_C4: RLOLIE Position                 */
#define ICS_C4_FLOLIE_MASK                       (0x01UL << ICS_C4_FLOLIE_SHIFT)                     /*!< ICS_C4: FLOLIE Mask                     */
#define ICS_C4_FLOLIE_SHIFT                      7                                                   /*!< ICS_C4: FLOLIE Position                 */
/* ------- S Bit Fields                             ------ */
#define ICS_S_CLKST_MASK                         (0x03UL << ICS_S_CLKST_SHIFT)                       /*!< ICS_S: CLKST Mask                       */
#define ICS_S_CLKST_SHIFT                        2                                                   /*!< ICS_S: CLKST Position                   */
#define ICS_S_CLKST(x)                           (((uint8_t)(((uint8_t)(x))<<ICS_S_CLKST_SHIFT))&ICS_S_CLKST_MASK) /*!< ICS_S                                   */
#define ICS_S_IREFST_MASK                        (0x01UL << ICS_S_IREFST_SHIFT)                      /*!< ICS_S: IREFST Mask                      */
#define ICS_S_IREFST_SHIFT                       4                                                   /*!< ICS_S: IREFST Position                  */
#define ICS_S_RLOCK_MASK                         (0x01UL << ICS_S_RLOCK_SHIFT)                       /*!< ICS_S: RLOCK Mask                       */
#define ICS_S_RLOCK_SHIFT                        5                                                   /*!< ICS_S: RLOCK Position                   */
#define ICS_S_FLOCK_MASK                         (0x01UL << ICS_S_FLOCK_SHIFT)                       /*!< ICS_S: FLOCK Mask                       */
#define ICS_S_FLOCK_SHIFT                        6                                                   /*!< ICS_S: FLOCK Position                   */
#define ICS_S_LOLS_MASK                          (0x01UL << ICS_S_LOLS_SHIFT)                        /*!< ICS_S: LOLS Mask                        */
#define ICS_S_LOLS_SHIFT                         7                                                   /*!< ICS_S: LOLS Position                    */
/**
 * @} */ /* End group ICS_Register_Masks_GROUP 
 */

/* ICS - Peripheral instance base addresses */
#define ICS_BasePtr                    0x40044000UL //!< Peripheral base address
#define ICS                            ((ICS_Type *) ICS_BasePtr) //!< Freescale base pointer
#define ICS_BASE_PTR                   (ICS) //!< Freescale style base pointer
/**
 * @} */ /* End group ICS_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup IEVENT_Peripheral_access_layer_GROUP IEVENT Peripheral Access Layer
* @brief C Struct for IEVENT
* @{
*/

/* ================================================================================ */
/* ================           IEVENT (file:IEVENT_0)               ================ */
/* ================================================================================ */

/**
 * @brief Intelligent event controller
 */
/**
* @addtogroup IEVENT_structs_GROUP IEVENT struct
* @brief Struct for IEVENT
* @{
*/
typedef struct {                                /*       IEVENT Structure                                             */
   __IO uint32_t  DRL;                          /**< 0000: iEvent Data Register: Low                                    */
   __I  uint32_t  RESERVED0[31];               
   __IO uint32_t  CRL;                          /**< 0080: iEvent Control Register: Low                                 */
   __I  uint32_t  RESERVED1[31];               
   __I  uint32_t  IMXCR0;                       /**< 0100: iEvent Input Mux Configuration Register                      */
   __IO uint32_t  BFECR0;                       /**< 0104: iEvent Boolean Function Eva1ation Configuration Register     */
   __I  uint32_t  IMXCR1;                       /**< 0108: iEvent Input Mux Configuration Register                      */
   __IO uint32_t  BFECR1;                       /**< 010C: iEvent Boolean Function Eva1ation Configuration Register     */
   __I  uint32_t  IMXCR2;                       /**< 0110: iEvent Input Mux Configuration Register                      */
   __IO uint32_t  BFECR2;                       /**< 0114: iEvent Boolean Function Eva1ation Configuration Register     */
   __I  uint32_t  IMXCR3;                       /**< 0118: iEvent Input Mux Configuration Register                      */
   __IO uint32_t  BFECR3;                       /**< 011C: iEvent Boolean Function Eva1ation Configuration Register     */
} IEVENT_Type;

/**
 * @} */ /* End group IEVENT_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'IEVENT' Position & Mask macros                      ----------- */
/* -------------------------------------------------------------------------------- */

