podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MKE14D7.h
/**
* @addtogroup IEVENT_Register_Masks_GROUP IEVENT Register Masks
* @brief Register Masks for IEVENT
* @{
*/
/* ------- DRL Bit Fields                           ------ */
#define IEVENT_DRL_IN_A0_MASK                    (0x01UL << IEVENT_DRL_IN_A0_SHIFT)                  /*!< IEVENT_DRL: IN_A0 Mask                  */
#define IEVENT_DRL_IN_A0_SHIFT                   0                                                   /*!< IEVENT_DRL: IN_A0 Position              */
#define IEVENT_DRL_IN_B0_MASK                    (0x01UL << IEVENT_DRL_IN_B0_SHIFT)                  /*!< IEVENT_DRL: IN_B0 Mask                  */
#define IEVENT_DRL_IN_B0_SHIFT                   1                                                   /*!< IEVENT_DRL: IN_B0 Position              */
#define IEVENT_DRL_IN_C0_MASK                    (0x01UL << IEVENT_DRL_IN_C0_SHIFT)                  /*!< IEVENT_DRL: IN_C0 Mask                  */
#define IEVENT_DRL_IN_C0_SHIFT                   2                                                   /*!< IEVENT_DRL: IN_C0 Position              */
#define IEVENT_DRL_IN_D0_MASK                    (0x01UL << IEVENT_DRL_IN_D0_SHIFT)                  /*!< IEVENT_DRL: IN_D0 Mask                  */
#define IEVENT_DRL_IN_D0_SHIFT                   3                                                   /*!< IEVENT_DRL: IN_D0 Position              */
#define IEVENT_DRL_Output_FSM0_MASK              (0x07UL << IEVENT_DRL_Output_FSM0_SHIFT)            /*!< IEVENT_DRL: Output_FSM0 Mask            */
#define IEVENT_DRL_Output_FSM0_SHIFT             4                                                   /*!< IEVENT_DRL: Output_FSM0 Position        */
#define IEVENT_DRL_Output_FSM0(x)                (((uint32_t)(((uint32_t)(x))<<IEVENT_DRL_Output_FSM0_SHIFT))&IEVENT_DRL_Output_FSM0_MASK) /*!< IEVENT_DRL                              */
#define IEVENT_DRL_Ev_Out0_MASK                  (0x01UL << IEVENT_DRL_Ev_Out0_SHIFT)                /*!< IEVENT_DRL: Ev_Out0 Mask                */
#define IEVENT_DRL_Ev_Out0_SHIFT                 7                                                   /*!< IEVENT_DRL: Ev_Out0 Position            */
#define IEVENT_DRL_IN_A1_MASK                    (0x01UL << IEVENT_DRL_IN_A1_SHIFT)                  /*!< IEVENT_DRL: IN_A1 Mask                  */
#define IEVENT_DRL_IN_A1_SHIFT                   8                                                   /*!< IEVENT_DRL: IN_A1 Position              */
#define IEVENT_DRL_IN_B1_MASK                    (0x01UL << IEVENT_DRL_IN_B1_SHIFT)                  /*!< IEVENT_DRL: IN_B1 Mask                  */
#define IEVENT_DRL_IN_B1_SHIFT                   9                                                   /*!< IEVENT_DRL: IN_B1 Position              */
#define IEVENT_DRL_IN_C1_MASK                    (0x01UL << IEVENT_DRL_IN_C1_SHIFT)                  /*!< IEVENT_DRL: IN_C1 Mask                  */
#define IEVENT_DRL_IN_C1_SHIFT                   10                                                  /*!< IEVENT_DRL: IN_C1 Position              */
#define IEVENT_DRL_IN_D1_MASK                    (0x01UL << IEVENT_DRL_IN_D1_SHIFT)                  /*!< IEVENT_DRL: IN_D1 Mask                  */
#define IEVENT_DRL_IN_D1_SHIFT                   11                                                  /*!< IEVENT_DRL: IN_D1 Position              */
#define IEVENT_DRL_Output_FSM1_MASK              (0x07UL << IEVENT_DRL_Output_FSM1_SHIFT)            /*!< IEVENT_DRL: Output_FSM1 Mask            */
#define IEVENT_DRL_Output_FSM1_SHIFT             12                                                  /*!< IEVENT_DRL: Output_FSM1 Position        */
#define IEVENT_DRL_Output_FSM1(x)                (((uint32_t)(((uint32_t)(x))<<IEVENT_DRL_Output_FSM1_SHIFT))&IEVENT_DRL_Output_FSM1_MASK) /*!< IEVENT_DRL                              */
#define IEVENT_DRL_Ev_Out1_MASK                  (0x01UL << IEVENT_DRL_Ev_Out1_SHIFT)                /*!< IEVENT_DRL: Ev_Out1 Mask                */
#define IEVENT_DRL_Ev_Out1_SHIFT                 15                                                  /*!< IEVENT_DRL: Ev_Out1 Position            */
#define IEVENT_DRL_IN_A2_MASK                    (0x01UL << IEVENT_DRL_IN_A2_SHIFT)                  /*!< IEVENT_DRL: IN_A2 Mask                  */
#define IEVENT_DRL_IN_A2_SHIFT                   16                                                  /*!< IEVENT_DRL: IN_A2 Position              */
#define IEVENT_DRL_IN_B2_MASK                    (0x01UL << IEVENT_DRL_IN_B2_SHIFT)                  /*!< IEVENT_DRL: IN_B2 Mask                  */
#define IEVENT_DRL_IN_B2_SHIFT                   17                                                  /*!< IEVENT_DRL: IN_B2 Position              */
#define IEVENT_DRL_IN_C2_MASK                    (0x01UL << IEVENT_DRL_IN_C2_SHIFT)                  /*!< IEVENT_DRL: IN_C2 Mask                  */
#define IEVENT_DRL_IN_C2_SHIFT                   18                                                  /*!< IEVENT_DRL: IN_C2 Position              */
#define IEVENT_DRL_IN_D2_MASK                    (0x01UL << IEVENT_DRL_IN_D2_SHIFT)                  /*!< IEVENT_DRL: IN_D2 Mask                  */
#define IEVENT_DRL_IN_D2_SHIFT                   19                                                  /*!< IEVENT_DRL: IN_D2 Position              */
#define IEVENT_DRL_Output_FSM2_MASK              (0x07UL << IEVENT_DRL_Output_FSM2_SHIFT)            /*!< IEVENT_DRL: Output_FSM2 Mask            */
#define IEVENT_DRL_Output_FSM2_SHIFT             20                                                  /*!< IEVENT_DRL: Output_FSM2 Position        */
#define IEVENT_DRL_Output_FSM2(x)                (((uint32_t)(((uint32_t)(x))<<IEVENT_DRL_Output_FSM2_SHIFT))&IEVENT_DRL_Output_FSM2_MASK) /*!< IEVENT_DRL                              */
#define IEVENT_DRL_Ev_Out2_MASK                  (0x01UL << IEVENT_DRL_Ev_Out2_SHIFT)                /*!< IEVENT_DRL: Ev_Out2 Mask                */
#define IEVENT_DRL_Ev_Out2_SHIFT                 23                                                  /*!< IEVENT_DRL: Ev_Out2 Position            */
#define IEVENT_DRL_IN_A3_MASK                    (0x01UL << IEVENT_DRL_IN_A3_SHIFT)                  /*!< IEVENT_DRL: IN_A3 Mask                  */
#define IEVENT_DRL_IN_A3_SHIFT                   24                                                  /*!< IEVENT_DRL: IN_A3 Position              */
#define IEVENT_DRL_IN_B3_MASK                    (0x01UL << IEVENT_DRL_IN_B3_SHIFT)                  /*!< IEVENT_DRL: IN_B3 Mask                  */
#define IEVENT_DRL_IN_B3_SHIFT                   25                                                  /*!< IEVENT_DRL: IN_B3 Position              */
#define IEVENT_DRL_IN_C3_MASK                    (0x01UL << IEVENT_DRL_IN_C3_SHIFT)                  /*!< IEVENT_DRL: IN_C3 Mask                  */
#define IEVENT_DRL_IN_C3_SHIFT                   26                                                  /*!< IEVENT_DRL: IN_C3 Position              */
#define IEVENT_DRL_IN_D3_MASK                    (0x01UL << IEVENT_DRL_IN_D3_SHIFT)                  /*!< IEVENT_DRL: IN_D3 Mask                  */
#define IEVENT_DRL_IN_D3_SHIFT                   27                                                  /*!< IEVENT_DRL: IN_D3 Position              */
#define IEVENT_DRL_Output_FSM3_MASK              (0x07UL << IEVENT_DRL_Output_FSM3_SHIFT)            /*!< IEVENT_DRL: Output_FSM3 Mask            */
#define IEVENT_DRL_Output_FSM3_SHIFT             28                                                  /*!< IEVENT_DRL: Output_FSM3 Position        */
#define IEVENT_DRL_Output_FSM3(x)                (((uint32_t)(((uint32_t)(x))<<IEVENT_DRL_Output_FSM3_SHIFT))&IEVENT_DRL_Output_FSM3_MASK) /*!< IEVENT_DRL                              */
#define IEVENT_DRL_Ev_Out3_MASK                  (0x01UL << IEVENT_DRL_Ev_Out3_SHIFT)                /*!< IEVENT_DRL: Ev_Out3 Mask                */
#define IEVENT_DRL_Ev_Out3_SHIFT                 31                                                  /*!< IEVENT_DRL: Ev_Out3 Position            */
/* ------- CRL Bit Fields                           ------ */
#define IEVENT_CRL_Type0_MASK                    (0x03UL << IEVENT_CRL_Type0_SHIFT)                  /*!< IEVENT_CRL: Type0 Mask                  */
#define IEVENT_CRL_Type0_SHIFT                   0                                                   /*!< IEVENT_CRL: Type0 Position              */
#define IEVENT_CRL_Type0(x)                      (((uint32_t)(((uint32_t)(x))<<IEVENT_CRL_Type0_SHIFT))&IEVENT_CRL_Type0_MASK) /*!< IEVENT_CRL                              */
#define IEVENT_CRL_OSE0_MASK                     (0x01UL << IEVENT_CRL_OSE0_SHIFT)                   /*!< IEVENT_CRL: OSE0 Mask                   */
#define IEVENT_CRL_OSE0_SHIFT                    2                                                   /*!< IEVENT_CRL: OSE0 Position               */
#define IEVENT_CRL_DDB0_MASK                     (0x01UL << IEVENT_CRL_DDB0_SHIFT)                   /*!< IEVENT_CRL: DDB0 Mask                   */
#define IEVENT_CRL_DDB0_SHIFT                    3                                                   /*!< IEVENT_CRL: DDB0 Position               */
#define IEVENT_CRL_RO0_MASK                      (0x01UL << IEVENT_CRL_RO0_SHIFT)                    /*!< IEVENT_CRL: RO0 Mask                    */
#define IEVENT_CRL_RO0_SHIFT                     7                                                   /*!< IEVENT_CRL: RO0 Position                */
#define IEVENT_CRL_Type1_MASK                    (0x03UL << IEVENT_CRL_Type1_SHIFT)                  /*!< IEVENT_CRL: Type1 Mask                  */
#define IEVENT_CRL_Type1_SHIFT                   8                                                   /*!< IEVENT_CRL: Type1 Position              */
#define IEVENT_CRL_Type1(x)                      (((uint32_t)(((uint32_t)(x))<<IEVENT_CRL_Type1_SHIFT))&IEVENT_CRL_Type1_MASK) /*!< IEVENT_CRL                              */
#define IEVENT_CRL_OSE1_MASK                     (0x01UL << IEVENT_CRL_OSE1_SHIFT)                   /*!< IEVENT_CRL: OSE1 Mask                   */
#define IEVENT_CRL_OSE1_SHIFT                    10                                                  /*!< IEVENT_CRL: OSE1 Position               */
#define IEVENT_CRL_DDB1_MASK                     (0x01UL << IEVENT_CRL_DDB1_SHIFT)                   /*!< IEVENT_CRL: DDB1 Mask                   */
#define IEVENT_CRL_DDB1_SHIFT                    11                                                  /*!< IEVENT_CRL: DDB1 Position               */
#define IEVENT_CRL_RO1_MASK                      (0x01UL << IEVENT_CRL_RO1_SHIFT)                    /*!< IEVENT_CRL: RO1 Mask                    */
#define IEVENT_CRL_RO1_SHIFT                     15                                                  /*!< IEVENT_CRL: RO1 Position                */
#define IEVENT_CRL_Type2_MASK                    (0x03UL << IEVENT_CRL_Type2_SHIFT)                  /*!< IEVENT_CRL: Type2 Mask                  */
#define IEVENT_CRL_Type2_SHIFT                   16                                                  /*!< IEVENT_CRL: Type2 Position              */
#define IEVENT_CRL_Type2(x)                      (((uint32_t)(((uint32_t)(x))<<IEVENT_CRL_Type2_SHIFT))&IEVENT_CRL_Type2_MASK) /*!< IEVENT_CRL                              */
#define IEVENT_CRL_OSE2_MASK                     (0x01UL << IEVENT_CRL_OSE2_SHIFT)                   /*!< IEVENT_CRL: OSE2 Mask                   */
#define IEVENT_CRL_OSE2_SHIFT                    18                                                  /*!< IEVENT_CRL: OSE2 Position               */
#define IEVENT_CRL_DDB2_MASK                     (0x01UL << IEVENT_CRL_DDB2_SHIFT)                   /*!< IEVENT_CRL: DDB2 Mask                   */
#define IEVENT_CRL_DDB2_SHIFT                    19                                                  /*!< IEVENT_CRL: DDB2 Position               */
#define IEVENT_CRL_RO2_MASK                      (0x01UL << IEVENT_CRL_RO2_SHIFT)                    /*!< IEVENT_CRL: RO2 Mask                    */
#define IEVENT_CRL_RO2_SHIFT                     23                                                  /*!< IEVENT_CRL: RO2 Position                */
#define IEVENT_CRL_Type3_MASK                    (0x03UL << IEVENT_CRL_Type3_SHIFT)                  /*!< IEVENT_CRL: Type3 Mask                  */
#define IEVENT_CRL_Type3_SHIFT                   24                                                  /*!< IEVENT_CRL: Type3 Position              */
#define IEVENT_CRL_Type3(x)                      (((uint32_t)(((uint32_t)(x))<<IEVENT_CRL_Type3_SHIFT))&IEVENT_CRL_Type3_MASK) /*!< IEVENT_CRL                              */
#define IEVENT_CRL_OSE3_MASK                     (0x01UL << IEVENT_CRL_OSE3_SHIFT)                   /*!< IEVENT_CRL: OSE3 Mask                   */
#define IEVENT_CRL_OSE3_SHIFT                    26                                                  /*!< IEVENT_CRL: OSE3 Position               */
#define IEVENT_CRL_DDB3_MASK                     (0x01UL << IEVENT_CRL_DDB3_SHIFT)                   /*!< IEVENT_CRL: DDB3 Mask                   */
#define IEVENT_CRL_DDB3_SHIFT                    27                                                  /*!< IEVENT_CRL: DDB3 Position               */
#define IEVENT_CRL_RO3_MASK                      (0x01UL << IEVENT_CRL_RO3_SHIFT)                    /*!< IEVENT_CRL: RO3 Mask                    */
#define IEVENT_CRL_RO3_SHIFT                     31                                                  /*!< IEVENT_CRL: RO3 Position                */
/* ------- IMXCR0 Bit Fields                        ------ */
#define IEVENT_IMXCR0_D_Select_MASK              (0x0FUL << IEVENT_IMXCR0_D_Select_SHIFT)            /*!< IEVENT_IMXCR0: D_Select Mask            */
#define IEVENT_IMXCR0_D_Select_SHIFT             0                                                   /*!< IEVENT_IMXCR0: D_Select Position        */
#define IEVENT_IMXCR0_D_Select(x)                (((uint32_t)(((uint32_t)(x))<<IEVENT_IMXCR0_D_Select_SHIFT))&IEVENT_IMXCR0_D_Select_MASK) /*!< IEVENT_IMXCR0                           */
#define IEVENT_IMXCR0_C_Select_MASK              (0x0FUL << IEVENT_IMXCR0_C_Select_SHIFT)            /*!< IEVENT_IMXCR0: C_Select Mask            */
#define IEVENT_IMXCR0_C_Select_SHIFT             8                                                   /*!< IEVENT_IMXCR0: C_Select Position        */
#define IEVENT_IMXCR0_C_Select(x)                (((uint32_t)(((uint32_t)(x))<<IEVENT_IMXCR0_C_Select_SHIFT))&IEVENT_IMXCR0_C_Select_MASK) /*!< IEVENT_IMXCR0                           */
#define IEVENT_IMXCR0_B_Select_MASK              (0x0FUL << IEVENT_IMXCR0_B_Select_SHIFT)            /*!< IEVENT_IMXCR0: B_Select Mask            */
#define IEVENT_IMXCR0_B_Select_SHIFT             16                                                  /*!< IEVENT_IMXCR0: B_Select Position        */
#define IEVENT_IMXCR0_B_Select(x)                (((uint32_t)(((uint32_t)(x))<<IEVENT_IMXCR0_B_Select_SHIFT))&IEVENT_IMXCR0_B_Select_MASK) /*!< IEVENT_IMXCR0                           */
#define IEVENT_IMXCR0_A_Select_MASK              (0x0FUL << IEVENT_IMXCR0_A_Select_SHIFT)            /*!< IEVENT_IMXCR0: A_Select Mask            */
#define IEVENT_IMXCR0_A_Select_SHIFT             24                                                  /*!< IEVENT_IMXCR0: A_Select Position        */
#define IEVENT_IMXCR0_A_Select(x)                (((uint32_t)(((uint32_t)(x))<<IEVENT_IMXCR0_A_Select_SHIFT))&IEVENT_IMXCR0_A_Select_MASK) /*!< IEVENT_IMXCR0                           */
/* ------- BFECR0 Bit Fields                        ------ */
#define IEVENT_BFECR0_PT3_DC_MASK                (0x03UL << IEVENT_BFECR0_PT3_DC_SHIFT)              /*!< IEVENT_BFECR0: PT3_DC Mask              */
#define IEVENT_BFECR0_PT3_DC_SHIFT               0                                                   /*!< IEVENT_BFECR0: PT3_DC Position          */
#define IEVENT_BFECR0_PT3_DC(x)                  (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR0_PT3_DC_SHIFT))&IEVENT_BFECR0_PT3_DC_MASK) /*!< IEVENT_BFECR0                           */
#define IEVENT_BFECR0_PT3_CC_MASK                (0x03UL << IEVENT_BFECR0_PT3_CC_SHIFT)              /*!< IEVENT_BFECR0: PT3_CC Mask              */
#define IEVENT_BFECR0_PT3_CC_SHIFT               2                                                   /*!< IEVENT_BFECR0: PT3_CC Position          */
#define IEVENT_BFECR0_PT3_CC(x)                  (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR0_PT3_CC_SHIFT))&IEVENT_BFECR0_PT3_CC_MASK) /*!< IEVENT_BFECR0                           */
#define IEVENT_BFECR0_PT3_BC_MASK                (0x03UL << IEVENT_BFECR0_PT3_BC_SHIFT)              /*!< IEVENT_BFECR0: PT3_BC Mask              */
#define IEVENT_BFECR0_PT3_BC_SHIFT               4                                                   /*!< IEVENT_BFECR0: PT3_BC Position          */
#define IEVENT_BFECR0_PT3_BC(x)                  (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR0_PT3_BC_SHIFT))&IEVENT_BFECR0_PT3_BC_MASK) /*!< IEVENT_BFECR0                           */
#define IEVENT_BFECR0_PT3_AC_MASK                (0x03UL << IEVENT_BFECR0_PT3_AC_SHIFT)              /*!< IEVENT_BFECR0: PT3_AC Mask              */
#define IEVENT_BFECR0_PT3_AC_SHIFT               6                                                   /*!< IEVENT_BFECR0: PT3_AC Position          */
#define IEVENT_BFECR0_PT3_AC(x)                  (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR0_PT3_AC_SHIFT))&IEVENT_BFECR0_PT3_AC_MASK) /*!< IEVENT_BFECR0                           */
#define IEVENT_BFECR0_PT2_DC_MASK                (0x03UL << IEVENT_BFECR0_PT2_DC_SHIFT)              /*!< IEVENT_BFECR0: PT2_DC Mask              */
#define IEVENT_BFECR0_PT2_DC_SHIFT               8                                                   /*!< IEVENT_BFECR0: PT2_DC Position          */
#define IEVENT_BFECR0_PT2_DC(x)                  (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR0_PT2_DC_SHIFT))&IEVENT_BFECR0_PT2_DC_MASK) /*!< IEVENT_BFECR0                           */
#define IEVENT_BFECR0_PT2_CC_MASK                (0x03UL << IEVENT_BFECR0_PT2_CC_SHIFT)              /*!< IEVENT_BFECR0: PT2_CC Mask              */
#define IEVENT_BFECR0_PT2_CC_SHIFT               10                                                  /*!< IEVENT_BFECR0: PT2_CC Position          */
#define IEVENT_BFECR0_PT2_CC(x)                  (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR0_PT2_CC_SHIFT))&IEVENT_BFECR0_PT2_CC_MASK) /*!< IEVENT_BFECR0                           */
#define IEVENT_BFECR0_PT2_BC_MASK                (0x03UL << IEVENT_BFECR0_PT2_BC_SHIFT)              /*!< IEVENT_BFECR0: PT2_BC Mask              */
#define IEVENT_BFECR0_PT2_BC_SHIFT               12                                                  /*!< IEVENT_BFECR0: PT2_BC Position          */
#define IEVENT_BFECR0_PT2_BC(x)                  (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR0_PT2_BC_SHIFT))&IEVENT_BFECR0_PT2_BC_MASK) /*!< IEVENT_BFECR0                           */
#define IEVENT_BFECR0_PT2_AC_MASK                (0x03UL << IEVENT_BFECR0_PT2_AC_SHIFT)              /*!< IEVENT_BFECR0: PT2_AC Mask              */
#define IEVENT_BFECR0_PT2_AC_SHIFT               14                                                  /*!< IEVENT_BFECR0: PT2_AC Position          */
#define IEVENT_BFECR0_PT2_AC(x)                  (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR0_PT2_AC_SHIFT))&IEVENT_BFECR0_PT2_AC_MASK) /*!< IEVENT_BFECR0                           */
#define IEVENT_BFECR0_PT1_DC_MASK                (0x03UL << IEVENT_BFECR0_PT1_DC_SHIFT)              /*!< IEVENT_BFECR0: PT1_DC Mask              */
#define IEVENT_BFECR0_PT1_DC_SHIFT               16                                                  /*!< IEVENT_BFECR0: PT1_DC Position          */
#define IEVENT_BFECR0_PT1_DC(x)                  (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR0_PT1_DC_SHIFT))&IEVENT_BFECR0_PT1_DC_MASK) /*!< IEVENT_BFECR0                           */
#define IEVENT_BFECR0_PT1_CC_MASK                (0x03UL << IEVENT_BFECR0_PT1_CC_SHIFT)              /*!< IEVENT_BFECR0: PT1_CC Mask              */
#define IEVENT_BFECR0_PT1_CC_SHIFT               18                                                  /*!< IEVENT_BFECR0: PT1_CC Position          */
#define IEVENT_BFECR0_PT1_CC(x)                  (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR0_PT1_CC_SHIFT))&IEVENT_BFECR0_PT1_CC_MASK) /*!< IEVENT_BFECR0                           */
#define IEVENT_BFECR0_PT1_BC_MASK                (0x03UL << IEVENT_BFECR0_PT1_BC_SHIFT)              /*!< IEVENT_BFECR0: PT1_BC Mask              */
#define IEVENT_BFECR0_PT1_BC_SHIFT               20                                                  /*!< IEVENT_BFECR0: PT1_BC Position          */
#define IEVENT_BFECR0_PT1_BC(x)                  (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR0_PT1_BC_SHIFT))&IEVENT_BFECR0_PT1_BC_MASK) /*!< IEVENT_BFECR0                           */
#define IEVENT_BFECR0_PT1_AC_MASK                (0x03UL << IEVENT_BFECR0_PT1_AC_SHIFT)              /*!< IEVENT_BFECR0: PT1_AC Mask              */
#define IEVENT_BFECR0_PT1_AC_SHIFT               22                                                  /*!< IEVENT_BFECR0: PT1_AC Position          */
#define IEVENT_BFECR0_PT1_AC(x)                  (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR0_PT1_AC_SHIFT))&IEVENT_BFECR0_PT1_AC_MASK) /*!< IEVENT_BFECR0                           */
#define IEVENT_BFECR0_PT0_DC_MASK                (0x03UL << IEVENT_BFECR0_PT0_DC_SHIFT)              /*!< IEVENT_BFECR0: PT0_DC Mask              */
#define IEVENT_BFECR0_PT0_DC_SHIFT               24                                                  /*!< IEVENT_BFECR0: PT0_DC Position          */
#define IEVENT_BFECR0_PT0_DC(x)                  (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR0_PT0_DC_SHIFT))&IEVENT_BFECR0_PT0_DC_MASK) /*!< IEVENT_BFECR0                           */
#define IEVENT_BFECR0_PT0_CC_MASK                (0x03UL << IEVENT_BFECR0_PT0_CC_SHIFT)              /*!< IEVENT_BFECR0: PT0_CC Mask              */
#define IEVENT_BFECR0_PT0_CC_SHIFT               26                                                  /*!< IEVENT_BFECR0: PT0_CC Position          */
#define IEVENT_BFECR0_PT0_CC(x)                  (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR0_PT0_CC_SHIFT))&IEVENT_BFECR0_PT0_CC_MASK) /*!< IEVENT_BFECR0                           */
#define IEVENT_BFECR0_PT0_BC_MASK                (0x03UL << IEVENT_BFECR0_PT0_BC_SHIFT)              /*!< IEVENT_BFECR0: PT0_BC Mask              */
#define IEVENT_BFECR0_PT0_BC_SHIFT               28                                                  /*!< IEVENT_BFECR0: PT0_BC Position          */
#define IEVENT_BFECR0_PT0_BC(x)                  (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR0_PT0_BC_SHIFT))&IEVENT_BFECR0_PT0_BC_MASK) /*!< IEVENT_BFECR0                           */
#define IEVENT_BFECR0_PT0_AC_MASK                (0x03UL << IEVENT_BFECR0_PT0_AC_SHIFT)              /*!< IEVENT_BFECR0: PT0_AC Mask              */
#define IEVENT_BFECR0_PT0_AC_SHIFT               30                                                  /*!< IEVENT_BFECR0: PT0_AC Position          */
#define IEVENT_BFECR0_PT0_AC(x)                  (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR0_PT0_AC_SHIFT))&IEVENT_BFECR0_PT0_AC_MASK) /*!< IEVENT_BFECR0                           */
/* ------- IMXCR1 Bit Fields                        ------ */
#define IEVENT_IMXCR1_D_Select_MASK              (0x0FUL << IEVENT_IMXCR1_D_Select_SHIFT)            /*!< IEVENT_IMXCR1: D_Select Mask            */
#define IEVENT_IMXCR1_D_Select_SHIFT             0                                                   /*!< IEVENT_IMXCR1: D_Select Position        */
#define IEVENT_IMXCR1_D_Select(x)                (((uint32_t)(((uint32_t)(x))<<IEVENT_IMXCR1_D_Select_SHIFT))&IEVENT_IMXCR1_D_Select_MASK) /*!< IEVENT_IMXCR1                           */
