podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MKE14D7.h
#define IEVENT_IMXCR1_C_Select_MASK              (0x0FUL << IEVENT_IMXCR1_C_Select_SHIFT)            /*!< IEVENT_IMXCR1: C_Select Mask            */
#define IEVENT_IMXCR1_C_Select_SHIFT             8                                                   /*!< IEVENT_IMXCR1: C_Select Position        */
#define IEVENT_IMXCR1_C_Select(x)                (((uint32_t)(((uint32_t)(x))<<IEVENT_IMXCR1_C_Select_SHIFT))&IEVENT_IMXCR1_C_Select_MASK) /*!< IEVENT_IMXCR1                           */
#define IEVENT_IMXCR1_B_Select_MASK              (0x0FUL << IEVENT_IMXCR1_B_Select_SHIFT)            /*!< IEVENT_IMXCR1: B_Select Mask            */
#define IEVENT_IMXCR1_B_Select_SHIFT             16                                                  /*!< IEVENT_IMXCR1: B_Select Position        */
#define IEVENT_IMXCR1_B_Select(x)                (((uint32_t)(((uint32_t)(x))<<IEVENT_IMXCR1_B_Select_SHIFT))&IEVENT_IMXCR1_B_Select_MASK) /*!< IEVENT_IMXCR1                           */
#define IEVENT_IMXCR1_A_Select_MASK              (0x0FUL << IEVENT_IMXCR1_A_Select_SHIFT)            /*!< IEVENT_IMXCR1: A_Select Mask            */
#define IEVENT_IMXCR1_A_Select_SHIFT             24                                                  /*!< IEVENT_IMXCR1: A_Select Position        */
#define IEVENT_IMXCR1_A_Select(x)                (((uint32_t)(((uint32_t)(x))<<IEVENT_IMXCR1_A_Select_SHIFT))&IEVENT_IMXCR1_A_Select_MASK) /*!< IEVENT_IMXCR1                           */
/* ------- BFECR1 Bit Fields                        ------ */
#define IEVENT_BFECR1_PT3_DC_MASK                (0x03UL << IEVENT_BFECR1_PT3_DC_SHIFT)              /*!< IEVENT_BFECR1: PT3_DC Mask              */
#define IEVENT_BFECR1_PT3_DC_SHIFT               0                                                   /*!< IEVENT_BFECR1: PT3_DC Position          */
#define IEVENT_BFECR1_PT3_DC(x)                  (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR1_PT3_DC_SHIFT))&IEVENT_BFECR1_PT3_DC_MASK) /*!< IEVENT_BFECR1                           */
#define IEVENT_BFECR1_PT3_CC_MASK                (0x03UL << IEVENT_BFECR1_PT3_CC_SHIFT)              /*!< IEVENT_BFECR1: PT3_CC Mask              */
#define IEVENT_BFECR1_PT3_CC_SHIFT               2                                                   /*!< IEVENT_BFECR1: PT3_CC Position          */
#define IEVENT_BFECR1_PT3_CC(x)                  (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR1_PT3_CC_SHIFT))&IEVENT_BFECR1_PT3_CC_MASK) /*!< IEVENT_BFECR1                           */
#define IEVENT_BFECR1_PT3_BC_MASK                (0x03UL << IEVENT_BFECR1_PT3_BC_SHIFT)              /*!< IEVENT_BFECR1: PT3_BC Mask              */
#define IEVENT_BFECR1_PT3_BC_SHIFT               4                                                   /*!< IEVENT_BFECR1: PT3_BC Position          */
#define IEVENT_BFECR1_PT3_BC(x)                  (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR1_PT3_BC_SHIFT))&IEVENT_BFECR1_PT3_BC_MASK) /*!< IEVENT_BFECR1                           */
#define IEVENT_BFECR1_PT3_AC_MASK                (0x03UL << IEVENT_BFECR1_PT3_AC_SHIFT)              /*!< IEVENT_BFECR1: PT3_AC Mask              */
#define IEVENT_BFECR1_PT3_AC_SHIFT               6                                                   /*!< IEVENT_BFECR1: PT3_AC Position          */
#define IEVENT_BFECR1_PT3_AC(x)                  (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR1_PT3_AC_SHIFT))&IEVENT_BFECR1_PT3_AC_MASK) /*!< IEVENT_BFECR1                           */
#define IEVENT_BFECR1_PT2_DC_MASK                (0x03UL << IEVENT_BFECR1_PT2_DC_SHIFT)              /*!< IEVENT_BFECR1: PT2_DC Mask              */
#define IEVENT_BFECR1_PT2_DC_SHIFT               8                                                   /*!< IEVENT_BFECR1: PT2_DC Position          */
#define IEVENT_BFECR1_PT2_DC(x)                  (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR1_PT2_DC_SHIFT))&IEVENT_BFECR1_PT2_DC_MASK) /*!< IEVENT_BFECR1                           */
#define IEVENT_BFECR1_PT2_CC_MASK                (0x03UL << IEVENT_BFECR1_PT2_CC_SHIFT)              /*!< IEVENT_BFECR1: PT2_CC Mask              */
#define IEVENT_BFECR1_PT2_CC_SHIFT               10                                                  /*!< IEVENT_BFECR1: PT2_CC Position          */
#define IEVENT_BFECR1_PT2_CC(x)                  (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR1_PT2_CC_SHIFT))&IEVENT_BFECR1_PT2_CC_MASK) /*!< IEVENT_BFECR1                           */
#define IEVENT_BFECR1_PT2_BC_MASK                (0x03UL << IEVENT_BFECR1_PT2_BC_SHIFT)              /*!< IEVENT_BFECR1: PT2_BC Mask              */
#define IEVENT_BFECR1_PT2_BC_SHIFT               12                                                  /*!< IEVENT_BFECR1: PT2_BC Position          */
#define IEVENT_BFECR1_PT2_BC(x)                  (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR1_PT2_BC_SHIFT))&IEVENT_BFECR1_PT2_BC_MASK) /*!< IEVENT_BFECR1                           */
#define IEVENT_BFECR1_PT2_AC_MASK                (0x03UL << IEVENT_BFECR1_PT2_AC_SHIFT)              /*!< IEVENT_BFECR1: PT2_AC Mask              */
#define IEVENT_BFECR1_PT2_AC_SHIFT               14                                                  /*!< IEVENT_BFECR1: PT2_AC Position          */
#define IEVENT_BFECR1_PT2_AC(x)                  (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR1_PT2_AC_SHIFT))&IEVENT_BFECR1_PT2_AC_MASK) /*!< IEVENT_BFECR1                           */
#define IEVENT_BFECR1_PT1_DC_MASK                (0x03UL << IEVENT_BFECR1_PT1_DC_SHIFT)              /*!< IEVENT_BFECR1: PT1_DC Mask              */
#define IEVENT_BFECR1_PT1_DC_SHIFT               16                                                  /*!< IEVENT_BFECR1: PT1_DC Position          */
#define IEVENT_BFECR1_PT1_DC(x)                  (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR1_PT1_DC_SHIFT))&IEVENT_BFECR1_PT1_DC_MASK) /*!< IEVENT_BFECR1                           */
#define IEVENT_BFECR1_PT1_CC_MASK                (0x03UL << IEVENT_BFECR1_PT1_CC_SHIFT)              /*!< IEVENT_BFECR1: PT1_CC Mask              */
#define IEVENT_BFECR1_PT1_CC_SHIFT               18                                                  /*!< IEVENT_BFECR1: PT1_CC Position          */
#define IEVENT_BFECR1_PT1_CC(x)                  (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR1_PT1_CC_SHIFT))&IEVENT_BFECR1_PT1_CC_MASK) /*!< IEVENT_BFECR1                           */
#define IEVENT_BFECR1_PT1_BC_MASK                (0x03UL << IEVENT_BFECR1_PT1_BC_SHIFT)              /*!< IEVENT_BFECR1: PT1_BC Mask              */
#define IEVENT_BFECR1_PT1_BC_SHIFT               20                                                  /*!< IEVENT_BFECR1: PT1_BC Position          */
#define IEVENT_BFECR1_PT1_BC(x)                  (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR1_PT1_BC_SHIFT))&IEVENT_BFECR1_PT1_BC_MASK) /*!< IEVENT_BFECR1                           */
#define IEVENT_BFECR1_PT1_AC_MASK                (0x03UL << IEVENT_BFECR1_PT1_AC_SHIFT)              /*!< IEVENT_BFECR1: PT1_AC Mask              */
#define IEVENT_BFECR1_PT1_AC_SHIFT               22                                                  /*!< IEVENT_BFECR1: PT1_AC Position          */
#define IEVENT_BFECR1_PT1_AC(x)                  (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR1_PT1_AC_SHIFT))&IEVENT_BFECR1_PT1_AC_MASK) /*!< IEVENT_BFECR1                           */
#define IEVENT_BFECR1_PT0_DC_MASK                (0x03UL << IEVENT_BFECR1_PT0_DC_SHIFT)              /*!< IEVENT_BFECR1: PT0_DC Mask              */
#define IEVENT_BFECR1_PT0_DC_SHIFT               24                                                  /*!< IEVENT_BFECR1: PT0_DC Position          */
#define IEVENT_BFECR1_PT0_DC(x)                  (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR1_PT0_DC_SHIFT))&IEVENT_BFECR1_PT0_DC_MASK) /*!< IEVENT_BFECR1                           */
#define IEVENT_BFECR1_PT0_CC_MASK                (0x03UL << IEVENT_BFECR1_PT0_CC_SHIFT)              /*!< IEVENT_BFECR1: PT0_CC Mask              */
#define IEVENT_BFECR1_PT0_CC_SHIFT               26                                                  /*!< IEVENT_BFECR1: PT0_CC Position          */
#define IEVENT_BFECR1_PT0_CC(x)                  (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR1_PT0_CC_SHIFT))&IEVENT_BFECR1_PT0_CC_MASK) /*!< IEVENT_BFECR1                           */
#define IEVENT_BFECR1_PT0_BC_MASK                (0x03UL << IEVENT_BFECR1_PT0_BC_SHIFT)              /*!< IEVENT_BFECR1: PT0_BC Mask              */
#define IEVENT_BFECR1_PT0_BC_SHIFT               28                                                  /*!< IEVENT_BFECR1: PT0_BC Position          */
#define IEVENT_BFECR1_PT0_BC(x)                  (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR1_PT0_BC_SHIFT))&IEVENT_BFECR1_PT0_BC_MASK) /*!< IEVENT_BFECR1                           */
#define IEVENT_BFECR1_PT0_AC_MASK                (0x03UL << IEVENT_BFECR1_PT0_AC_SHIFT)              /*!< IEVENT_BFECR1: PT0_AC Mask              */
#define IEVENT_BFECR1_PT0_AC_SHIFT               30                                                  /*!< IEVENT_BFECR1: PT0_AC Position          */
#define IEVENT_BFECR1_PT0_AC(x)                  (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR1_PT0_AC_SHIFT))&IEVENT_BFECR1_PT0_AC_MASK) /*!< IEVENT_BFECR1                           */
/* ------- IMXCR2 Bit Fields                        ------ */
#define IEVENT_IMXCR2_D_Select_MASK              (0x0FUL << IEVENT_IMXCR2_D_Select_SHIFT)            /*!< IEVENT_IMXCR2: D_Select Mask            */
#define IEVENT_IMXCR2_D_Select_SHIFT             0                                                   /*!< IEVENT_IMXCR2: D_Select Position        */
#define IEVENT_IMXCR2_D_Select(x)                (((uint32_t)(((uint32_t)(x))<<IEVENT_IMXCR2_D_Select_SHIFT))&IEVENT_IMXCR2_D_Select_MASK) /*!< IEVENT_IMXCR2                           */
#define IEVENT_IMXCR2_C_Select_MASK              (0x0FUL << IEVENT_IMXCR2_C_Select_SHIFT)            /*!< IEVENT_IMXCR2: C_Select Mask            */
#define IEVENT_IMXCR2_C_Select_SHIFT             8                                                   /*!< IEVENT_IMXCR2: C_Select Position        */
#define IEVENT_IMXCR2_C_Select(x)                (((uint32_t)(((uint32_t)(x))<<IEVENT_IMXCR2_C_Select_SHIFT))&IEVENT_IMXCR2_C_Select_MASK) /*!< IEVENT_IMXCR2                           */
#define IEVENT_IMXCR2_B_Select_MASK              (0x0FUL << IEVENT_IMXCR2_B_Select_SHIFT)            /*!< IEVENT_IMXCR2: B_Select Mask            */
#define IEVENT_IMXCR2_B_Select_SHIFT             16                                                  /*!< IEVENT_IMXCR2: B_Select Position        */
#define IEVENT_IMXCR2_B_Select(x)                (((uint32_t)(((uint32_t)(x))<<IEVENT_IMXCR2_B_Select_SHIFT))&IEVENT_IMXCR2_B_Select_MASK) /*!< IEVENT_IMXCR2                           */
#define IEVENT_IMXCR2_A_Select_MASK              (0x0FUL << IEVENT_IMXCR2_A_Select_SHIFT)            /*!< IEVENT_IMXCR2: A_Select Mask            */
#define IEVENT_IMXCR2_A_Select_SHIFT             24                                                  /*!< IEVENT_IMXCR2: A_Select Position        */
#define IEVENT_IMXCR2_A_Select(x)                (((uint32_t)(((uint32_t)(x))<<IEVENT_IMXCR2_A_Select_SHIFT))&IEVENT_IMXCR2_A_Select_MASK) /*!< IEVENT_IMXCR2                           */
/* ------- BFECR2 Bit Fields                        ------ */
#define IEVENT_BFECR2_PT3_DC_MASK                (0x03UL << IEVENT_BFECR2_PT3_DC_SHIFT)              /*!< IEVENT_BFECR2: PT3_DC Mask              */
#define IEVENT_BFECR2_PT3_DC_SHIFT               0                                                   /*!< IEVENT_BFECR2: PT3_DC Position          */
#define IEVENT_BFECR2_PT3_DC(x)                  (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR2_PT3_DC_SHIFT))&IEVENT_BFECR2_PT3_DC_MASK) /*!< IEVENT_BFECR2                           */
#define IEVENT_BFECR2_PT3_CC_MASK                (0x03UL << IEVENT_BFECR2_PT3_CC_SHIFT)              /*!< IEVENT_BFECR2: PT3_CC Mask              */
#define IEVENT_BFECR2_PT3_CC_SHIFT               2                                                   /*!< IEVENT_BFECR2: PT3_CC Position          */
#define IEVENT_BFECR2_PT3_CC(x)                  (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR2_PT3_CC_SHIFT))&IEVENT_BFECR2_PT3_CC_MASK) /*!< IEVENT_BFECR2                           */
#define IEVENT_BFECR2_PT3_BC_MASK                (0x03UL << IEVENT_BFECR2_PT3_BC_SHIFT)              /*!< IEVENT_BFECR2: PT3_BC Mask              */
#define IEVENT_BFECR2_PT3_BC_SHIFT               4                                                   /*!< IEVENT_BFECR2: PT3_BC Position          */
#define IEVENT_BFECR2_PT3_BC(x)                  (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR2_PT3_BC_SHIFT))&IEVENT_BFECR2_PT3_BC_MASK) /*!< IEVENT_BFECR2                           */
#define IEVENT_BFECR2_PT3_AC_MASK                (0x03UL << IEVENT_BFECR2_PT3_AC_SHIFT)              /*!< IEVENT_BFECR2: PT3_AC Mask              */
#define IEVENT_BFECR2_PT3_AC_SHIFT               6                                                   /*!< IEVENT_BFECR2: PT3_AC Position          */
#define IEVENT_BFECR2_PT3_AC(x)                  (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR2_PT3_AC_SHIFT))&IEVENT_BFECR2_PT3_AC_MASK) /*!< IEVENT_BFECR2                           */
#define IEVENT_BFECR2_PT2_DC_MASK                (0x03UL << IEVENT_BFECR2_PT2_DC_SHIFT)              /*!< IEVENT_BFECR2: PT2_DC Mask              */
#define IEVENT_BFECR2_PT2_DC_SHIFT               8                                                   /*!< IEVENT_BFECR2: PT2_DC Position          */
#define IEVENT_BFECR2_PT2_DC(x)                  (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR2_PT2_DC_SHIFT))&IEVENT_BFECR2_PT2_DC_MASK) /*!< IEVENT_BFECR2                           */
#define IEVENT_BFECR2_PT2_CC_MASK                (0x03UL << IEVENT_BFECR2_PT2_CC_SHIFT)              /*!< IEVENT_BFECR2: PT2_CC Mask              */
#define IEVENT_BFECR2_PT2_CC_SHIFT               10                                                  /*!< IEVENT_BFECR2: PT2_CC Position          */
#define IEVENT_BFECR2_PT2_CC(x)                  (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR2_PT2_CC_SHIFT))&IEVENT_BFECR2_PT2_CC_MASK) /*!< IEVENT_BFECR2                           */
#define IEVENT_BFECR2_PT2_BC_MASK                (0x03UL << IEVENT_BFECR2_PT2_BC_SHIFT)              /*!< IEVENT_BFECR2: PT2_BC Mask              */
#define IEVENT_BFECR2_PT2_BC_SHIFT               12                                                  /*!< IEVENT_BFECR2: PT2_BC Position          */
#define IEVENT_BFECR2_PT2_BC(x)                  (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR2_PT2_BC_SHIFT))&IEVENT_BFECR2_PT2_BC_MASK) /*!< IEVENT_BFECR2                           */
#define IEVENT_BFECR2_PT2_AC_MASK                (0x03UL << IEVENT_BFECR2_PT2_AC_SHIFT)              /*!< IEVENT_BFECR2: PT2_AC Mask              */
#define IEVENT_BFECR2_PT2_AC_SHIFT               14                                                  /*!< IEVENT_BFECR2: PT2_AC Position          */
#define IEVENT_BFECR2_PT2_AC(x)                  (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR2_PT2_AC_SHIFT))&IEVENT_BFECR2_PT2_AC_MASK) /*!< IEVENT_BFECR2                           */
#define IEVENT_BFECR2_PT1_DC_MASK                (0x03UL << IEVENT_BFECR2_PT1_DC_SHIFT)              /*!< IEVENT_BFECR2: PT1_DC Mask              */
#define IEVENT_BFECR2_PT1_DC_SHIFT               16                                                  /*!< IEVENT_BFECR2: PT1_DC Position          */
#define IEVENT_BFECR2_PT1_DC(x)                  (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR2_PT1_DC_SHIFT))&IEVENT_BFECR2_PT1_DC_MASK) /*!< IEVENT_BFECR2                           */
#define IEVENT_BFECR2_PT1_CC_MASK                (0x03UL << IEVENT_BFECR2_PT1_CC_SHIFT)              /*!< IEVENT_BFECR2: PT1_CC Mask              */
#define IEVENT_BFECR2_PT1_CC_SHIFT               18                                                  /*!< IEVENT_BFECR2: PT1_CC Position          */
#define IEVENT_BFECR2_PT1_CC(x)                  (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR2_PT1_CC_SHIFT))&IEVENT_BFECR2_PT1_CC_MASK) /*!< IEVENT_BFECR2                           */
#define IEVENT_BFECR2_PT1_BC_MASK                (0x03UL << IEVENT_BFECR2_PT1_BC_SHIFT)              /*!< IEVENT_BFECR2: PT1_BC Mask              */
#define IEVENT_BFECR2_PT1_BC_SHIFT               20                                                  /*!< IEVENT_BFECR2: PT1_BC Position          */
#define IEVENT_BFECR2_PT1_BC(x)                  (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR2_PT1_BC_SHIFT))&IEVENT_BFECR2_PT1_BC_MASK) /*!< IEVENT_BFECR2                           */
#define IEVENT_BFECR2_PT1_AC_MASK                (0x03UL << IEVENT_BFECR2_PT1_AC_SHIFT)              /*!< IEVENT_BFECR2: PT1_AC Mask              */
#define IEVENT_BFECR2_PT1_AC_SHIFT               22                                                  /*!< IEVENT_BFECR2: PT1_AC Position          */
#define IEVENT_BFECR2_PT1_AC(x)                  (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR2_PT1_AC_SHIFT))&IEVENT_BFECR2_PT1_AC_MASK) /*!< IEVENT_BFECR2                           */
#define IEVENT_BFECR2_PT0_DC_MASK                (0x03UL << IEVENT_BFECR2_PT0_DC_SHIFT)              /*!< IEVENT_BFECR2: PT0_DC Mask              */
#define IEVENT_BFECR2_PT0_DC_SHIFT               24                                                  /*!< IEVENT_BFECR2: PT0_DC Position          */
#define IEVENT_BFECR2_PT0_DC(x)                  (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR2_PT0_DC_SHIFT))&IEVENT_BFECR2_PT0_DC_MASK) /*!< IEVENT_BFECR2                           */
#define IEVENT_BFECR2_PT0_CC_MASK                (0x03UL << IEVENT_BFECR2_PT0_CC_SHIFT)              /*!< IEVENT_BFECR2: PT0_CC Mask              */
#define IEVENT_BFECR2_PT0_CC_SHIFT               26                                                  /*!< IEVENT_BFECR2: PT0_CC Position          */
#define IEVENT_BFECR2_PT0_CC(x)                  (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR2_PT0_CC_SHIFT))&IEVENT_BFECR2_PT0_CC_MASK) /*!< IEVENT_BFECR2                           */
#define IEVENT_BFECR2_PT0_BC_MASK                (0x03UL << IEVENT_BFECR2_PT0_BC_SHIFT)              /*!< IEVENT_BFECR2: PT0_BC Mask              */
#define IEVENT_BFECR2_PT0_BC_SHIFT               28                                                  /*!< IEVENT_BFECR2: PT0_BC Position          */
#define IEVENT_BFECR2_PT0_BC(x)                  (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR2_PT0_BC_SHIFT))&IEVENT_BFECR2_PT0_BC_MASK) /*!< IEVENT_BFECR2                           */
#define IEVENT_BFECR2_PT0_AC_MASK                (0x03UL << IEVENT_BFECR2_PT0_AC_SHIFT)              /*!< IEVENT_BFECR2: PT0_AC Mask              */
#define IEVENT_BFECR2_PT0_AC_SHIFT               30                                                  /*!< IEVENT_BFECR2: PT0_AC Position          */
#define IEVENT_BFECR2_PT0_AC(x)                  (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR2_PT0_AC_SHIFT))&IEVENT_BFECR2_PT0_AC_MASK) /*!< IEVENT_BFECR2                           */
/* ------- IMXCR3 Bit Fields                        ------ */
#define IEVENT_IMXCR3_D_Select_MASK              (0x0FUL << IEVENT_IMXCR3_D_Select_SHIFT)            /*!< IEVENT_IMXCR3: D_Select Mask            */
#define IEVENT_IMXCR3_D_Select_SHIFT             0                                                   /*!< IEVENT_IMXCR3: D_Select Position        */
#define IEVENT_IMXCR3_D_Select(x)                (((uint32_t)(((uint32_t)(x))<<IEVENT_IMXCR3_D_Select_SHIFT))&IEVENT_IMXCR3_D_Select_MASK) /*!< IEVENT_IMXCR3                           */
#define IEVENT_IMXCR3_C_Select_MASK              (0x0FUL << IEVENT_IMXCR3_C_Select_SHIFT)            /*!< IEVENT_IMXCR3: C_Select Mask            */
#define IEVENT_IMXCR3_C_Select_SHIFT             8                                                   /*!< IEVENT_IMXCR3: C_Select Position        */
#define IEVENT_IMXCR3_C_Select(x)                (((uint32_t)(((uint32_t)(x))<<IEVENT_IMXCR3_C_Select_SHIFT))&IEVENT_IMXCR3_C_Select_MASK) /*!< IEVENT_IMXCR3                           */
#define IEVENT_IMXCR3_B_Select_MASK              (0x0FUL << IEVENT_IMXCR3_B_Select_SHIFT)            /*!< IEVENT_IMXCR3: B_Select Mask            */
#define IEVENT_IMXCR3_B_Select_SHIFT             16                                                  /*!< IEVENT_IMXCR3: B_Select Position        */
#define IEVENT_IMXCR3_B_Select(x)                (((uint32_t)(((uint32_t)(x))<<IEVENT_IMXCR3_B_Select_SHIFT))&IEVENT_IMXCR3_B_Select_MASK) /*!< IEVENT_IMXCR3                           */
#define IEVENT_IMXCR3_A_Select_MASK              (0x0FUL << IEVENT_IMXCR3_A_Select_SHIFT)            /*!< IEVENT_IMXCR3: A_Select Mask            */
#define IEVENT_IMXCR3_A_Select_SHIFT             24                                                  /*!< IEVENT_IMXCR3: A_Select Position        */
#define IEVENT_IMXCR3_A_Select(x)                (((uint32_t)(((uint32_t)(x))<<IEVENT_IMXCR3_A_Select_SHIFT))&IEVENT_IMXCR3_A_Select_MASK) /*!< IEVENT_IMXCR3                           */
/* ------- BFECR3 Bit Fields                        ------ */
#define IEVENT_BFECR3_PT3_DC_MASK                (0x03UL << IEVENT_BFECR3_PT3_DC_SHIFT)              /*!< IEVENT_BFECR3: PT3_DC Mask              */
#define IEVENT_BFECR3_PT3_DC_SHIFT               0                                                   /*!< IEVENT_BFECR3: PT3_DC Position          */
#define IEVENT_BFECR3_PT3_DC(x)                  (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR3_PT3_DC_SHIFT))&IEVENT_BFECR3_PT3_DC_MASK) /*!< IEVENT_BFECR3                           */
#define IEVENT_BFECR3_PT3_CC_MASK                (0x03UL << IEVENT_BFECR3_PT3_CC_SHIFT)              /*!< IEVENT_BFECR3: PT3_CC Mask              */
#define IEVENT_BFECR3_PT3_CC_SHIFT               2                                                   /*!< IEVENT_BFECR3: PT3_CC Position          */
#define IEVENT_BFECR3_PT3_CC(x)                  (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR3_PT3_CC_SHIFT))&IEVENT_BFECR3_PT3_CC_MASK) /*!< IEVENT_BFECR3                           */
#define IEVENT_BFECR3_PT3_BC_MASK                (0x03UL << IEVENT_BFECR3_PT3_BC_SHIFT)              /*!< IEVENT_BFECR3: PT3_BC Mask              */
#define IEVENT_BFECR3_PT3_BC_SHIFT               4                                                   /*!< IEVENT_BFECR3: PT3_BC Position          */
#define IEVENT_BFECR3_PT3_BC(x)                  (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR3_PT3_BC_SHIFT))&IEVENT_BFECR3_PT3_BC_MASK) /*!< IEVENT_BFECR3                           */
#define IEVENT_BFECR3_PT3_AC_MASK                (0x03UL << IEVENT_BFECR3_PT3_AC_SHIFT)              /*!< IEVENT_BFECR3: PT3_AC Mask              */
#define IEVENT_BFECR3_PT3_AC_SHIFT               6                                                   /*!< IEVENT_BFECR3: PT3_AC Position          */
#define IEVENT_BFECR3_PT3_AC(x)                  (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR3_PT3_AC_SHIFT))&IEVENT_BFECR3_PT3_AC_MASK) /*!< IEVENT_BFECR3                           */
#define IEVENT_BFECR3_PT2_DC_MASK                (0x03UL << IEVENT_BFECR3_PT2_DC_SHIFT)              /*!< IEVENT_BFECR3: PT2_DC Mask              */
#define IEVENT_BFECR3_PT2_DC_SHIFT               8                                                   /*!< IEVENT_BFECR3: PT2_DC Position          */
#define IEVENT_BFECR3_PT2_DC(x)                  (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR3_PT2_DC_SHIFT))&IEVENT_BFECR3_PT2_DC_MASK) /*!< IEVENT_BFECR3                           */
#define IEVENT_BFECR3_PT2_CC_MASK                (0x03UL << IEVENT_BFECR3_PT2_CC_SHIFT)              /*!< IEVENT_BFECR3: PT2_CC Mask              */
#define IEVENT_BFECR3_PT2_CC_SHIFT               10                                                  /*!< IEVENT_BFECR3: PT2_CC Position          */
#define IEVENT_BFECR3_PT2_CC(x)                  (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR3_PT2_CC_SHIFT))&IEVENT_BFECR3_PT2_CC_MASK) /*!< IEVENT_BFECR3                           */
