podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MKE14D7.h
#define IEVENT_BFECR3_PT2_BC_MASK                (0x03UL << IEVENT_BFECR3_PT2_BC_SHIFT)              /*!< IEVENT_BFECR3: PT2_BC Mask              */
#define IEVENT_BFECR3_PT2_BC_SHIFT               12                                                  /*!< IEVENT_BFECR3: PT2_BC Position          */
#define IEVENT_BFECR3_PT2_BC(x)                  (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR3_PT2_BC_SHIFT))&IEVENT_BFECR3_PT2_BC_MASK) /*!< IEVENT_BFECR3                           */
#define IEVENT_BFECR3_PT2_AC_MASK                (0x03UL << IEVENT_BFECR3_PT2_AC_SHIFT)              /*!< IEVENT_BFECR3: PT2_AC Mask              */
#define IEVENT_BFECR3_PT2_AC_SHIFT               14                                                  /*!< IEVENT_BFECR3: PT2_AC Position          */
#define IEVENT_BFECR3_PT2_AC(x)                  (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR3_PT2_AC_SHIFT))&IEVENT_BFECR3_PT2_AC_MASK) /*!< IEVENT_BFECR3                           */
#define IEVENT_BFECR3_PT1_DC_MASK                (0x03UL << IEVENT_BFECR3_PT1_DC_SHIFT)              /*!< IEVENT_BFECR3: PT1_DC Mask              */
#define IEVENT_BFECR3_PT1_DC_SHIFT               16                                                  /*!< IEVENT_BFECR3: PT1_DC Position          */
#define IEVENT_BFECR3_PT1_DC(x)                  (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR3_PT1_DC_SHIFT))&IEVENT_BFECR3_PT1_DC_MASK) /*!< IEVENT_BFECR3                           */
#define IEVENT_BFECR3_PT1_CC_MASK                (0x03UL << IEVENT_BFECR3_PT1_CC_SHIFT)              /*!< IEVENT_BFECR3: PT1_CC Mask              */
#define IEVENT_BFECR3_PT1_CC_SHIFT               18                                                  /*!< IEVENT_BFECR3: PT1_CC Position          */
#define IEVENT_BFECR3_PT1_CC(x)                  (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR3_PT1_CC_SHIFT))&IEVENT_BFECR3_PT1_CC_MASK) /*!< IEVENT_BFECR3                           */
#define IEVENT_BFECR3_PT1_BC_MASK                (0x03UL << IEVENT_BFECR3_PT1_BC_SHIFT)              /*!< IEVENT_BFECR3: PT1_BC Mask              */
#define IEVENT_BFECR3_PT1_BC_SHIFT               20                                                  /*!< IEVENT_BFECR3: PT1_BC Position          */
#define IEVENT_BFECR3_PT1_BC(x)                  (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR3_PT1_BC_SHIFT))&IEVENT_BFECR3_PT1_BC_MASK) /*!< IEVENT_BFECR3                           */
#define IEVENT_BFECR3_PT1_AC_MASK                (0x03UL << IEVENT_BFECR3_PT1_AC_SHIFT)              /*!< IEVENT_BFECR3: PT1_AC Mask              */
#define IEVENT_BFECR3_PT1_AC_SHIFT               22                                                  /*!< IEVENT_BFECR3: PT1_AC Position          */
#define IEVENT_BFECR3_PT1_AC(x)                  (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR3_PT1_AC_SHIFT))&IEVENT_BFECR3_PT1_AC_MASK) /*!< IEVENT_BFECR3                           */
#define IEVENT_BFECR3_PT0_DC_MASK                (0x03UL << IEVENT_BFECR3_PT0_DC_SHIFT)              /*!< IEVENT_BFECR3: PT0_DC Mask              */
#define IEVENT_BFECR3_PT0_DC_SHIFT               24                                                  /*!< IEVENT_BFECR3: PT0_DC Position          */
#define IEVENT_BFECR3_PT0_DC(x)                  (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR3_PT0_DC_SHIFT))&IEVENT_BFECR3_PT0_DC_MASK) /*!< IEVENT_BFECR3                           */
#define IEVENT_BFECR3_PT0_CC_MASK                (0x03UL << IEVENT_BFECR3_PT0_CC_SHIFT)              /*!< IEVENT_BFECR3: PT0_CC Mask              */
#define IEVENT_BFECR3_PT0_CC_SHIFT               26                                                  /*!< IEVENT_BFECR3: PT0_CC Position          */
#define IEVENT_BFECR3_PT0_CC(x)                  (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR3_PT0_CC_SHIFT))&IEVENT_BFECR3_PT0_CC_MASK) /*!< IEVENT_BFECR3                           */
#define IEVENT_BFECR3_PT0_BC_MASK                (0x03UL << IEVENT_BFECR3_PT0_BC_SHIFT)              /*!< IEVENT_BFECR3: PT0_BC Mask              */
#define IEVENT_BFECR3_PT0_BC_SHIFT               28                                                  /*!< IEVENT_BFECR3: PT0_BC Position          */
#define IEVENT_BFECR3_PT0_BC(x)                  (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR3_PT0_BC_SHIFT))&IEVENT_BFECR3_PT0_BC_MASK) /*!< IEVENT_BFECR3                           */
#define IEVENT_BFECR3_PT0_AC_MASK                (0x03UL << IEVENT_BFECR3_PT0_AC_SHIFT)              /*!< IEVENT_BFECR3: PT0_AC Mask              */
#define IEVENT_BFECR3_PT0_AC_SHIFT               30                                                  /*!< IEVENT_BFECR3: PT0_AC Position          */
#define IEVENT_BFECR3_PT0_AC(x)                  (((uint32_t)(((uint32_t)(x))<<IEVENT_BFECR3_PT0_AC_SHIFT))&IEVENT_BFECR3_PT0_AC_MASK) /*!< IEVENT_BFECR3                           */
/**
 * @} */ /* End group IEVENT_Register_Masks_GROUP 
 */

/* IEVENT - Peripheral instance base addresses */
#define IEVENT_BasePtr                 0x40019000UL //!< Peripheral base address
#define IEVENT                         ((IEVENT_Type *) IEVENT_BasePtr) //!< Freescale base pointer
#define IEVENT_BASE_PTR                (IEVENT) //!< Freescale style base pointer
/**
 * @} */ /* End group IEVENT_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup MCM_Peripheral_access_layer_GROUP MCM Peripheral Access Layer
* @brief C Struct for MCM
* @{
*/

/* ================================================================================ */
/* ================           MCM (file:MCM_MKE14D7)               ================ */
/* ================================================================================ */

/**
 * @brief Core Platform Miscellaneous Control Module
 */
/**
* @addtogroup MCM_structs_GROUP MCM struct
* @brief Struct for MCM
* @{
*/
typedef struct {                                /*       MCM Structure                                                */
   __I  uint32_t  RESERVED0[2];                
   __I  uint16_t  PLASC;                        /**< 0008: Crossbar Switch (AXBS) Slave Configuration                   */
   __I  uint16_t  PLAMC;                        /**< 000A: Crossbar Switch (AXBS) Master Configuration                  */
   __IO uint32_t  CR;                           /**< 000C: Control Register                                             */
   __I  uint32_t  RESERVED1[8];                
   __IO uint32_t  PID;                          /**< 0030: Process ID register                                          */
} MCM_Type;

/**
 * @} */ /* End group MCM_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'MCM' Position & Mask macros                         ----------- */
/* -------------------------------------------------------------------------------- */

/**
* @addtogroup MCM_Register_Masks_GROUP MCM Register Masks
* @brief Register Masks for MCM
* @{
*/
/* ------- PLASC Bit Fields                         ------ */
#define MCM_PLASC_ASC_MASK                       (0xFFUL << MCM_PLASC_ASC_SHIFT)                     /*!< MCM_PLASC: ASC Mask                     */
#define MCM_PLASC_ASC_SHIFT                      0                                                   /*!< MCM_PLASC: ASC Position                 */
#define MCM_PLASC_ASC(x)                         (((uint16_t)(((uint16_t)(x))<<MCM_PLASC_ASC_SHIFT))&MCM_PLASC_ASC_MASK) /*!< MCM_PLASC                               */
/* ------- PLAMC Bit Fields                         ------ */
#define MCM_PLAMC_AMC_MASK                       (0xFFUL << MCM_PLAMC_AMC_SHIFT)                     /*!< MCM_PLAMC: AMC Mask                     */
#define MCM_PLAMC_AMC_SHIFT                      0                                                   /*!< MCM_PLAMC: AMC Position                 */
#define MCM_PLAMC_AMC(x)                         (((uint16_t)(((uint16_t)(x))<<MCM_PLAMC_AMC_SHIFT))&MCM_PLAMC_AMC_MASK) /*!< MCM_PLAMC                               */
/* ------- CR Bit Fields                            ------ */
#define MCM_CR_CBRR_MASK                         (0x01UL << MCM_CR_CBRR_SHIFT)                       /*!< MCM_CR: CBRR Mask                       */
#define MCM_CR_CBRR_SHIFT                        9                                                   /*!< MCM_CR: CBRR Position                   */
#define MCM_CR_SRAMUAP_MASK                      (0x03UL << MCM_CR_SRAMUAP_SHIFT)                    /*!< MCM_CR: SRAMUAP Mask                    */
#define MCM_CR_SRAMUAP_SHIFT                     24                                                  /*!< MCM_CR: SRAMUAP Position                */
#define MCM_CR_SRAMUAP(x)                        (((uint32_t)(((uint32_t)(x))<<MCM_CR_SRAMUAP_SHIFT))&MCM_CR_SRAMUAP_MASK) /*!< MCM_CR                                  */
#define MCM_CR_SRAMUWP_MASK                      (0x01UL << MCM_CR_SRAMUWP_SHIFT)                    /*!< MCM_CR: SRAMUWP Mask                    */
#define MCM_CR_SRAMUWP_SHIFT                     26                                                  /*!< MCM_CR: SRAMUWP Position                */
#define MCM_CR_SRAMLAP_MASK                      (0x03UL << MCM_CR_SRAMLAP_SHIFT)                    /*!< MCM_CR: SRAMLAP Mask                    */
#define MCM_CR_SRAMLAP_SHIFT                     28                                                  /*!< MCM_CR: SRAMLAP Position                */
#define MCM_CR_SRAMLAP(x)                        (((uint32_t)(((uint32_t)(x))<<MCM_CR_SRAMLAP_SHIFT))&MCM_CR_SRAMLAP_MASK) /*!< MCM_CR                                  */
#define MCM_CR_SRAMLWP_MASK                      (0x01UL << MCM_CR_SRAMLWP_SHIFT)                    /*!< MCM_CR: SRAMLWP Mask                    */
#define MCM_CR_SRAMLWP_SHIFT                     30                                                  /*!< MCM_CR: SRAMLWP Position                */
/* ------- PID Bit Fields                           ------ */
#define MCM_PID_PID_MASK                         (0xFFUL << MCM_PID_PID_SHIFT)                       /*!< MCM_PID: PID Mask                       */
#define MCM_PID_PID_SHIFT                        0                                                   /*!< MCM_PID: PID Position                   */
#define MCM_PID_PID(x)                           (((uint32_t)(((uint32_t)(x))<<MCM_PID_PID_SHIFT))&MCM_PID_PID_MASK) /*!< MCM_PID                                 */
/**
 * @} */ /* End group MCM_Register_Masks_GROUP 
 */

/* MCM - Peripheral instance base addresses */
#define MCM_BasePtr                    0xE0080000UL //!< Peripheral base address
#define MCM                            ((MCM_Type *) MCM_BasePtr) //!< Freescale base pointer
#define MCM_BASE_PTR                   (MCM) //!< Freescale style base pointer
/**
 * @} */ /* End group MCM_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup MPU_Peripheral_access_layer_GROUP MPU Peripheral Access Layer
* @brief C Struct for MPU
* @{
*/

/* ================================================================================ */
/* ================           MPU (file:MPU_MKE14D7_R8)            ================ */
/* ================================================================================ */

/**
 * @brief Memory protection unit
 */
/**
* @addtogroup MPU_structs_GROUP MPU struct
* @brief Struct for MPU
* @{
*/
typedef struct {                                /*       MPU Structure                                                */
   __IO uint32_t  CESR;                         /**< 0000: Control/Error Status Register                                */
   __I  uint32_t  RESERVED0[3];                
   struct {
      __I  uint32_t  EAR;                       /**< 0010: Error Address Register, Slave Port n                         */
      __I  uint32_t  EDR;                       /**< 0014: Error Detail Register, Slave Port n                          */
   } SP[5];                                     /**< 0010: (cluster: size=0x0028, 40)                                   */
   __I  uint32_t  RESERVED1[242];              
   struct {
      __IO uint32_t  WORD0;                     /**< 0400: Region Descriptor n, Word 0                                  */
      __IO uint32_t  WORD1;                     /**< 0404: Region Descriptor n, Word 1                                  */
      __IO uint32_t  WORD2;                     /**< 0408: Region Descriptor n, Word 2                                  */
      __IO uint32_t  WORD3;                     /**< 040C: Region Descriptor n, Word 3                                  */
   } RGD[8];                                    /**< 0400: (cluster: size=0x0080, 128)                                  */
   __I  uint32_t  RESERVED2[224];              
   __IO uint32_t  RGDAAC[8];                    /**< 0800: Region Descriptor Alternate Access Control n                 */
} MPU_Type;

/**
 * @} */ /* End group MPU_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'MPU' Position & Mask macros                         ----------- */
/* -------------------------------------------------------------------------------- */

