podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MKE14D7.h
/* MPU - Peripheral instance base addresses */
#define MPU_BasePtr                    0x4000D000UL //!< Peripheral base address
#define MPU                            ((MPU_Type *) MPU_BasePtr) //!< Freescale base pointer
#define MPU_BASE_PTR                   (MPU) //!< Freescale style base pointer
/**
 * @} */ /* End group MPU_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup NV_Peripheral_access_layer_GROUP NV Peripheral Access Layer
* @brief C Struct for NV
* @{
*/

/* ================================================================================ */
/* ================           NV (file:NV_FTMRA_0)                 ================ */
/* ================================================================================ */

/**
 * @brief Flash configuration field
 */
/**
* @addtogroup NV_structs_GROUP NV struct
* @brief Struct for NV
* @{
*/
typedef struct {                                /*       NV Structure                                                 */
   __I  uint8_t   BACKKEY3;                     /**< 0000: Backdoor Comparison Key 3                                    */
   __I  uint8_t   BACKKEY2;                     /**< 0001: Backdoor Comparison Key 2                                    */
   __I  uint8_t   BACKKEY1;                     /**< 0002: Backdoor Comparison Key 1                                    */
   __I  uint8_t   BACKKEY0;                     /**< 0003: Backdoor Comparison Key 0                                    */
   __I  uint8_t   BACKKEY7;                     /**< 0004: Backdoor Comparison Key 7                                    */
   __I  uint8_t   BACKKEY6;                     /**< 0005: Backdoor Comparison Key 6                                    */
   __I  uint8_t   BACKKEY5;                     /**< 0006: Backdoor Comparison Key 5                                    */
   __I  uint8_t   BACKKEY4;                     /**< 0007: Backdoor Comparison Key 4                                    */
   __I  uint32_t  RESERVED0;                   
   __I  uint8_t   FSEC;                         /**< 000C: Non-volatile Flash Security Register                         */
   __I  uint8_t   FOPT;                         /**< 000D: Non-volatile Flash Option Register                           */
   __I  uint8_t   FPROT;                        /**< 000E: Non-volatile P-Flash Protection Register                     */
   __I  uint8_t   DFPROT;                       /**< 000F: Non-volatile D-Flash Protection Register                     */
} NV_Type;

/**
 * @} */ /* End group NV_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'NV' Position & Mask macros                          ----------- */
/* -------------------------------------------------------------------------------- */

/**
* @addtogroup NV_Register_Masks_GROUP NV Register Masks
* @brief Register Masks for NV
* @{
*/
/* ------- BACKKEY Bit Fields                       ------ */
#define NV_BACKKEY_KEY_MASK                      (0xFFUL << NV_BACKKEY_KEY_SHIFT)                    /*!< NV_BACKKEY: KEY Mask                    */
#define NV_BACKKEY_KEY_SHIFT                     0                                                   /*!< NV_BACKKEY: KEY Position                */
#define NV_BACKKEY_KEY(x)                        (((uint8_t)(((uint8_t)(x))<<NV_BACKKEY_KEY_SHIFT))&NV_BACKKEY_KEY_MASK) /*!< NV_BACKKEY                              */
/* ------- FSEC Bit Fields                          ------ */
#define NV_FSEC_SEC_MASK                         (0x03UL << NV_FSEC_SEC_SHIFT)                       /*!< NV_FSEC: SEC Mask                       */
#define NV_FSEC_SEC_SHIFT                        0                                                   /*!< NV_FSEC: SEC Position                   */
#define NV_FSEC_SEC(x)                           (((uint8_t)(((uint8_t)(x))<<NV_FSEC_SEC_SHIFT))&NV_FSEC_SEC_MASK) /*!< NV_FSEC                                 */
#define NV_FSEC_KEYEN_MASK                       (0x03UL << NV_FSEC_KEYEN_SHIFT)                     /*!< NV_FSEC: KEYEN Mask                     */
#define NV_FSEC_KEYEN_SHIFT                      6                                                   /*!< NV_FSEC: KEYEN Position                 */
#define NV_FSEC_KEYEN(x)                         (((uint8_t)(((uint8_t)(x))<<NV_FSEC_KEYEN_SHIFT))&NV_FSEC_KEYEN_MASK) /*!< NV_FSEC                                 */
/* ------- FOPT Bit Fields                          ------ */
/* ------- FPROT Bit Fields                         ------ */
#define NV_FPROT_FPLS_MASK                       (0x03UL << NV_FPROT_FPLS_SHIFT)                     /*!< NV_FPROT: FPLS Mask                     */
#define NV_FPROT_FPLS_SHIFT                      0                                                   /*!< NV_FPROT: FPLS Position                 */
#define NV_FPROT_FPLS(x)                         (((uint8_t)(((uint8_t)(x))<<NV_FPROT_FPLS_SHIFT))&NV_FPROT_FPLS_MASK) /*!< NV_FPROT                                */
#define NV_FPROT_FPLDIS_MASK                     (0x01UL << NV_FPROT_FPLDIS_SHIFT)                   /*!< NV_FPROT: FPLDIS Mask                   */
#define NV_FPROT_FPLDIS_SHIFT                    2                                                   /*!< NV_FPROT: FPLDIS Position               */
#define NV_FPROT_FPHS_MASK                       (0x03UL << NV_FPROT_FPHS_SHIFT)                     /*!< NV_FPROT: FPHS Mask                     */
#define NV_FPROT_FPHS_SHIFT                      3                                                   /*!< NV_FPROT: FPHS Position                 */
#define NV_FPROT_FPHS(x)                         (((uint8_t)(((uint8_t)(x))<<NV_FPROT_FPHS_SHIFT))&NV_FPROT_FPHS_MASK) /*!< NV_FPROT                                */
#define NV_FPROT_FPHDIS_MASK                     (0x01UL << NV_FPROT_FPHDIS_SHIFT)                   /*!< NV_FPROT: FPHDIS Mask                   */
#define NV_FPROT_FPHDIS_SHIFT                    5                                                   /*!< NV_FPROT: FPHDIS Position               */
#define NV_FPROT_FPOPEN_MASK                     (0x01UL << NV_FPROT_FPOPEN_SHIFT)                   /*!< NV_FPROT: FPOPEN Mask                   */
#define NV_FPROT_FPOPEN_SHIFT                    7                                                   /*!< NV_FPROT: FPOPEN Position               */
/* ------- DFPROT Bit Fields                        ------ */
#define NV_DFPROT_DPS_MASK                       (0x1FUL << NV_DFPROT_DPS_SHIFT)                     /*!< NV_DFPROT: DPS Mask                     */
#define NV_DFPROT_DPS_SHIFT                      0                                                   /*!< NV_DFPROT: DPS Position                 */
#define NV_DFPROT_DPS(x)                         (((uint8_t)(((uint8_t)(x))<<NV_DFPROT_DPS_SHIFT))&NV_DFPROT_DPS_MASK) /*!< NV_DFPROT                               */
#define NV_DFPROT_DPOPEN_MASK                    (0x01UL << NV_DFPROT_DPOPEN_SHIFT)                  /*!< NV_DFPROT: DPOPEN Mask                  */
#define NV_DFPROT_DPOPEN_SHIFT                   7                                                   /*!< NV_DFPROT: DPOPEN Position              */
/**
 * @} */ /* End group NV_Register_Masks_GROUP 
 */

