podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MKE14D7.h
/**
 * @brief Reset control module
 */
/**
* @addtogroup RCM_structs_GROUP RCM struct
* @brief Struct for RCM
* @{
*/
typedef struct {                                /*       RCM Structure                                                */
   __I  uint8_t   SRSL;                         /**< 0000: RCM System Reset Status Low Register                         */
   __I  uint8_t   SRSH;                         /**< 0001: RCM System Reset Status High Register                        */
   __I  uint16_t  RESERVED0;                   
   __IO uint8_t   RPFC;                         /**< 0004: RCM RESETb Pin Filter Control Register                       */
   __IO uint8_t   RPFW;                         /**< 0005: RCM RESETb Pin Filter Width Register                         */
} RCM_Type;

/**
 * @} */ /* End group RCM_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'RCM' Position & Mask macros                         ----------- */
/* -------------------------------------------------------------------------------- */

/**
* @addtogroup RCM_Register_Masks_GROUP RCM Register Masks
* @brief Register Masks for RCM
* @{
*/
/* ------- SRSL Bit Fields                          ------ */
#define RCM_SRSL_LVD_MASK                        (0x01UL << RCM_SRSL_LVD_SHIFT)                      /*!< RCM_SRSL: LVD Mask                      */
#define RCM_SRSL_LVD_SHIFT                       1                                                   /*!< RCM_SRSL: LVD Position                  */
#define RCM_SRSL_LOC_MASK                        (0x01UL << RCM_SRSL_LOC_SHIFT)                      /*!< RCM_SRSL: LOC Mask                      */
#define RCM_SRSL_LOC_SHIFT                       2                                                   /*!< RCM_SRSL: LOC Position                  */
#define RCM_SRSL_COP_MASK                        (0x01UL << RCM_SRSL_COP_SHIFT)                      /*!< RCM_SRSL: COP Mask                      */
#define RCM_SRSL_COP_SHIFT                       5                                                   /*!< RCM_SRSL: COP Position                  */
#define RCM_SRSL_PIN_MASK                        (0x01UL << RCM_SRSL_PIN_SHIFT)                      /*!< RCM_SRSL: PIN Mask                      */
#define RCM_SRSL_PIN_SHIFT                       6                                                   /*!< RCM_SRSL: PIN Position                  */
#define RCM_SRSL_POR_MASK                        (0x01UL << RCM_SRSL_POR_SHIFT)                      /*!< RCM_SRSL: POR Mask                      */
#define RCM_SRSL_POR_SHIFT                       7                                                   /*!< RCM_SRSL: POR Position                  */
/* ------- SRSH Bit Fields                          ------ */
#define RCM_SRSH_JTAG_MASK                       (0x01UL << RCM_SRSH_JTAG_SHIFT)                     /*!< RCM_SRSH: JTAG Mask                     */
#define RCM_SRSH_JTAG_SHIFT                      0                                                   /*!< RCM_SRSH: JTAG Position                 */
#define RCM_SRSH_LOCKUP_MASK                     (0x01UL << RCM_SRSH_LOCKUP_SHIFT)                   /*!< RCM_SRSH: LOCKUP Mask                   */
#define RCM_SRSH_LOCKUP_SHIFT                    1                                                   /*!< RCM_SRSH: LOCKUP Position               */
#define RCM_SRSH_SW_MASK                         (0x01UL << RCM_SRSH_SW_SHIFT)                       /*!< RCM_SRSH: SW Mask                       */
#define RCM_SRSH_SW_SHIFT                        2                                                   /*!< RCM_SRSH: SW Position                   */
#define RCM_SRSH_MDMAP_MASK                      (0x01UL << RCM_SRSH_MDMAP_SHIFT)                    /*!< RCM_SRSH: MDMAP Mask                    */
#define RCM_SRSH_MDMAP_SHIFT                     3                                                   /*!< RCM_SRSH: MDMAP Position                */
#define RCM_SRSH_SACKERR_MASK                    (0x01UL << RCM_SRSH_SACKERR_SHIFT)                  /*!< RCM_SRSH: SACKERR Mask                  */
#define RCM_SRSH_SACKERR_SHIFT                   5                                                   /*!< RCM_SRSH: SACKERR Position              */
/* ------- RPFC Bit Fields                          ------ */
#define RCM_RPFC_RSTFLTSRW_MASK                  (0x03UL << RCM_RPFC_RSTFLTSRW_SHIFT)                /*!< RCM_RPFC: RSTFLTSRW Mask                */
#define RCM_RPFC_RSTFLTSRW_SHIFT                 0                                                   /*!< RCM_RPFC: RSTFLTSRW Position            */
#define RCM_RPFC_RSTFLTSRW(x)                    (((uint8_t)(((uint8_t)(x))<<RCM_RPFC_RSTFLTSRW_SHIFT))&RCM_RPFC_RSTFLTSRW_MASK) /*!< RCM_RPFC                                */
#define RCM_RPFC_RSTFLTSS_MASK                   (0x01UL << RCM_RPFC_RSTFLTSS_SHIFT)                 /*!< RCM_RPFC: RSTFLTSS Mask                 */
#define RCM_RPFC_RSTFLTSS_SHIFT                  2                                                   /*!< RCM_RPFC: RSTFLTSS Position             */
/* ------- RPFW Bit Fields                          ------ */
#define RCM_RPFW_RSTFLTSS_MASK                   (0x1FUL << RCM_RPFW_RSTFLTSS_SHIFT)                 /*!< RCM_RPFW: RSTFLTSS Mask                 */
#define RCM_RPFW_RSTFLTSS_SHIFT                  0                                                   /*!< RCM_RPFW: RSTFLTSS Position             */
#define RCM_RPFW_RSTFLTSS(x)                     (((uint8_t)(((uint8_t)(x))<<RCM_RPFW_RSTFLTSS_SHIFT))&RCM_RPFW_RSTFLTSS_MASK) /*!< RCM_RPFW                                */
/**
 * @} */ /* End group RCM_Register_Masks_GROUP 
 */

/* RCM - Peripheral instance base addresses */
#define RCM_BasePtr                    0x40057000UL //!< Peripheral base address
#define RCM                            ((RCM_Type *) RCM_BasePtr) //!< Freescale base pointer
#define RCM_BASE_PTR                   (RCM) //!< Freescale style base pointer
/**
 * @} */ /* End group RCM_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup RTC_Peripheral_access_layer_GROUP RTC Peripheral Access Layer
* @brief C Struct for RTC
* @{
*/

/* ================================================================================ */
/* ================           RTC (file:RTC_MKE10)                 ================ */
/* ================================================================================ */

/**
 * @brief Real-time counter
 */
/**
* @addtogroup RTC_structs_GROUP RTC struct
* @brief Struct for RTC
* @{
*/
typedef struct {                                /*       RTC Structure                                                */
   __IO uint32_t  SC;                           /**< 0000: Status and Control Register                                  */
   __IO uint32_t  MOD;                          /**< 0004: Modulo Register: Contains the modulo value used to reset the count to 0x0000 upon a compare match and set SC[RTIF] status field */
   __I  uint32_t  CNT;                          /**< 0008: Counter Register: Reset or writing different values to SC[RTCLKS] and SC[RTCPS] clear the count to 0x0000 */
} RTC_Type;

/**
 * @} */ /* End group RTC_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'RTC' Position & Mask macros                         ----------- */
/* -------------------------------------------------------------------------------- */

/**
* @addtogroup RTC_Register_Masks_GROUP RTC Register Masks
* @brief Register Masks for RTC
* @{
*/
/* ------- SC Bit Fields                            ------ */
#define RTC_SC_RTCO_MASK                         (0x01UL << RTC_SC_RTCO_SHIFT)                       /*!< RTC_SC: RTCO Mask                       */
#define RTC_SC_RTCO_SHIFT                        4                                                   /*!< RTC_SC: RTCO Position                   */
#define RTC_SC_DMAE_MASK                         (0x01UL << RTC_SC_DMAE_SHIFT)                       /*!< RTC_SC: DMAE Mask                       */
#define RTC_SC_DMAE_SHIFT                        5                                                   /*!< RTC_SC: DMAE Position                   */
#define RTC_SC_RTIE_MASK                         (0x01UL << RTC_SC_RTIE_SHIFT)                       /*!< RTC_SC: RTIE Mask                       */
#define RTC_SC_RTIE_SHIFT                        6                                                   /*!< RTC_SC: RTIE Position                   */
#define RTC_SC_RTIF_MASK                         (0x01UL << RTC_SC_RTIF_SHIFT)                       /*!< RTC_SC: RTIF Mask                       */
#define RTC_SC_RTIF_SHIFT                        7                                                   /*!< RTC_SC: RTIF Position                   */
#define RTC_SC_RTCPS_MASK                        (0x07UL << RTC_SC_RTCPS_SHIFT)                      /*!< RTC_SC: RTCPS Mask                      */
#define RTC_SC_RTCPS_SHIFT                       8                                                   /*!< RTC_SC: RTCPS Position                  */
#define RTC_SC_RTCPS(x)                          (((uint32_t)(((uint32_t)(x))<<RTC_SC_RTCPS_SHIFT))&RTC_SC_RTCPS_MASK) /*!< RTC_SC                                  */
#define RTC_SC_RTCLKS_MASK                       (0x03UL << RTC_SC_RTCLKS_SHIFT)                     /*!< RTC_SC: RTCLKS Mask                     */
#define RTC_SC_RTCLKS_SHIFT                      14                                                  /*!< RTC_SC: RTCLKS Position                 */
#define RTC_SC_RTCLKS(x)                         (((uint32_t)(((uint32_t)(x))<<RTC_SC_RTCLKS_SHIFT))&RTC_SC_RTCLKS_MASK) /*!< RTC_SC                                  */
/* ------- MOD Bit Fields                           ------ */
#define RTC_MOD_MOD_MASK                         (0xFFFFUL << RTC_MOD_MOD_SHIFT)                     /*!< RTC_MOD: MOD Mask                       */
#define RTC_MOD_MOD_SHIFT                        0                                                   /*!< RTC_MOD: MOD Position                   */
#define RTC_MOD_MOD(x)                           (((uint32_t)(((uint32_t)(x))<<RTC_MOD_MOD_SHIFT))&RTC_MOD_MOD_MASK) /*!< RTC_MOD                                 */
/* ------- CNT Bit Fields                           ------ */
#define RTC_CNT_CNT_MASK                         (0xFFFFUL << RTC_CNT_CNT_SHIFT)                     /*!< RTC_CNT: CNT Mask                       */
#define RTC_CNT_CNT_SHIFT                        0                                                   /*!< RTC_CNT: CNT Position                   */
#define RTC_CNT_CNT(x)                           (((uint32_t)(((uint32_t)(x))<<RTC_CNT_CNT_SHIFT))&RTC_CNT_CNT_MASK) /*!< RTC_CNT                                 */
/**
 * @} */ /* End group RTC_Register_Masks_GROUP 
 */

/* RTC - Peripheral instance base addresses */
#define RTC_BasePtr                    0x4002D000UL //!< Peripheral base address
#define RTC                            ((RTC_Type *) RTC_BasePtr) //!< Freescale base pointer
#define RTC_BASE_PTR                   (RTC) //!< Freescale style base pointer
/**
 * @} */ /* End group RTC_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup SIM_Peripheral_access_layer_GROUP SIM Peripheral Access Layer
* @brief C Struct for SIM
* @{
*/

/* ================================================================================ */
/* ================           SIM (file:SIM_MKE14D7)               ================ */
/* ================================================================================ */

/**
 * @brief System Integration Module
 */
/**
* @addtogroup SIM_structs_GROUP SIM struct
* @brief Struct for SIM
* @{
*/
typedef struct {                                /*       SIM Structure                                                */
   __I  uint32_t  RESERVED0;                   
   __IO uint32_t  SOPT2;                        /**< 0004: System Options Register 2                                    */
   __IO uint32_t  SOPT3;                        /**< 0008: System Options Register 3                                    */
   __IO uint32_t  SOPT4;                        /**< 000C: System Options Register 4                                    */
   __IO uint32_t  SOPT5;                        /**< 0010: System Options Register 5                                    */
   __IO uint32_t  SOPT6;                        /**< 0014: System Options Register 6                                    */
   __IO uint32_t  SOPT7;                        /**< 0018: System Options Register 7                                    */
   __I  uint32_t  RESERVED1[2];                
   __I  uint32_t  SDID;                         /**< 0024: System Device Identification Register                        */
   __I  uint32_t  RESERVED2[4];                
   __IO uint32_t  SCGC5;                        /**< 0038: System Clock Gating Control Register 5                       */
   __IO uint32_t  SCGC6;                        /**< 003C: System Clock Gating Control Register 6                       */
   __IO uint32_t  SCGC7;                        /**< 0040: System Clock Gating Control Register 7                       */
   __IO uint32_t  CLKDIV1;                      /**< 0044: System Clock Divider Register 1                              */
   __I  uint32_t  RESERVED3[3];                
   __I  uint32_t  UIDH;                         /**< 0054: Unique Identification Register High                          */
   __I  uint32_t  UIDMH;                        /**< 0058: Unique Identification Register Mid-High                      */
   __I  uint32_t  UIDML;                        /**< 005C: Unique Identification Register Mid Low                       */
   __I  uint32_t  UIDL;                         /**< 0060: Unique Identification Register Low                           */
} SIM_Type;

/**
 * @} */ /* End group SIM_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'SIM' Position & Mask macros                         ----------- */
/* -------------------------------------------------------------------------------- */

