podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MKE14D7.h
/**
* @addtogroup SIM_Register_Masks_GROUP SIM Register Masks
* @brief Register Masks for SIM
* @{
*/
/* ------- SOPT2 Bit Fields                         ------ */
#define SIM_SOPT2_FLLENSTOP4_MASK                (0x01UL << SIM_SOPT2_FLLENSTOP4_SHIFT)              /*!< SIM_SOPT2: FLLENSTOP4 Mask              */
#define SIM_SOPT2_FLLENSTOP4_SHIFT               0                                                   /*!< SIM_SOPT2: FLLENSTOP4 Position          */
#define SIM_SOPT2_RESETIFE_MASK                  (0x01UL << SIM_SOPT2_RESETIFE_SHIFT)                /*!< SIM_SOPT2: RESETIFE Mask                */
#define SIM_SOPT2_RESETIFE_SHIFT                 1                                                   /*!< SIM_SOPT2: RESETIFE Position            */
#define SIM_SOPT2_OBEPADSELA13_MASK              (0x03UL << SIM_SOPT2_OBEPADSELA13_SHIFT)            /*!< SIM_SOPT2: OBEPADSELA13 Mask            */
#define SIM_SOPT2_OBEPADSELA13_SHIFT             4                                                   /*!< SIM_SOPT2: OBEPADSELA13 Position        */
#define SIM_SOPT2_OBEPADSELA13(x)                (((uint32_t)(((uint32_t)(x))<<SIM_SOPT2_OBEPADSELA13_SHIFT))&SIM_SOPT2_OBEPADSELA13_MASK) /*!< SIM_SOPT2                               */
#define SIM_SOPT2_OBEPADSELA12_MASK              (0x03UL << SIM_SOPT2_OBEPADSELA12_SHIFT)            /*!< SIM_SOPT2: OBEPADSELA12 Mask            */
#define SIM_SOPT2_OBEPADSELA12_SHIFT             6                                                   /*!< SIM_SOPT2: OBEPADSELA12 Position        */
#define SIM_SOPT2_OBEPADSELA12(x)                (((uint32_t)(((uint32_t)(x))<<SIM_SOPT2_OBEPADSELA12_SHIFT))&SIM_SOPT2_OBEPADSELA12_MASK) /*!< SIM_SOPT2                               */
#define SIM_SOPT2_OBEPADSELA3_MASK               (0x03UL << SIM_SOPT2_OBEPADSELA3_SHIFT)             /*!< SIM_SOPT2: OBEPADSELA3 Mask             */
#define SIM_SOPT2_OBEPADSELA3_SHIFT              8                                                   /*!< SIM_SOPT2: OBEPADSELA3 Position         */
#define SIM_SOPT2_OBEPADSELA3(x)                 (((uint32_t)(((uint32_t)(x))<<SIM_SOPT2_OBEPADSELA3_SHIFT))&SIM_SOPT2_OBEPADSELA3_MASK) /*!< SIM_SOPT2                               */
#define SIM_SOPT2_OBEPADSELA2_MASK               (0x03UL << SIM_SOPT2_OBEPADSELA2_SHIFT)             /*!< SIM_SOPT2: OBEPADSELA2 Mask             */
#define SIM_SOPT2_OBEPADSELA2_SHIFT              10                                                  /*!< SIM_SOPT2: OBEPADSELA2 Position         */
#define SIM_SOPT2_OBEPADSELA2(x)                 (((uint32_t)(((uint32_t)(x))<<SIM_SOPT2_OBEPADSELA2_SHIFT))&SIM_SOPT2_OBEPADSELA2_MASK) /*!< SIM_SOPT2                               */
#define SIM_SOPT2_OBEPADSELE1_MASK               (0x03UL << SIM_SOPT2_OBEPADSELE1_SHIFT)             /*!< SIM_SOPT2: OBEPADSELE1 Mask             */
#define SIM_SOPT2_OBEPADSELE1_SHIFT              12                                                  /*!< SIM_SOPT2: OBEPADSELE1 Position         */
#define SIM_SOPT2_OBEPADSELE1(x)                 (((uint32_t)(((uint32_t)(x))<<SIM_SOPT2_OBEPADSELE1_SHIFT))&SIM_SOPT2_OBEPADSELE1_MASK) /*!< SIM_SOPT2                               */
#define SIM_SOPT2_OBEPADSELE0_MASK               (0x03UL << SIM_SOPT2_OBEPADSELE0_SHIFT)             /*!< SIM_SOPT2: OBEPADSELE0 Mask             */
#define SIM_SOPT2_OBEPADSELE0_SHIFT              14                                                  /*!< SIM_SOPT2: OBEPADSELE0 Position         */
#define SIM_SOPT2_OBEPADSELE0(x)                 (((uint32_t)(((uint32_t)(x))<<SIM_SOPT2_OBEPADSELE0_SHIFT))&SIM_SOPT2_OBEPADSELE0_MASK) /*!< SIM_SOPT2                               */
#define SIM_SOPT2_FBSL_MASK                      (0x03UL << SIM_SOPT2_FBSL_SHIFT)                    /*!< SIM_SOPT2: FBSL Mask                    */
#define SIM_SOPT2_FBSL_SHIFT                     16                                                  /*!< SIM_SOPT2: FBSL Position                */
#define SIM_SOPT2_FBSL(x)                        (((uint32_t)(((uint32_t)(x))<<SIM_SOPT2_FBSL_SHIFT))&SIM_SOPT2_FBSL_MASK) /*!< SIM_SOPT2                               */
#define SIM_SOPT2_TRACECLKSEL_MASK               (0x01UL << SIM_SOPT2_TRACECLKSEL_SHIFT)             /*!< SIM_SOPT2: TRACECLKSEL Mask             */
#define SIM_SOPT2_TRACECLKSEL_SHIFT              18                                                  /*!< SIM_SOPT2: TRACECLKSEL Position         */
#define SIM_SOPT2_RAMSIZE_MASK                   (0x01UL << SIM_SOPT2_RAMSIZE_SHIFT)                 /*!< SIM_SOPT2: RAMSIZE Mask                 */
#define SIM_SOPT2_RAMSIZE_SHIFT                  21                                                  /*!< SIM_SOPT2: RAMSIZE Position             */
#define SIM_SOPT2_FSIZE_MASK                     (0x03UL << SIM_SOPT2_FSIZE_SHIFT)                   /*!< SIM_SOPT2: FSIZE Mask                   */
#define SIM_SOPT2_FSIZE_SHIFT                    26                                                  /*!< SIM_SOPT2: FSIZE Position               */
#define SIM_SOPT2_FSIZE(x)                       (((uint32_t)(((uint32_t)(x))<<SIM_SOPT2_FSIZE_SHIFT))&SIM_SOPT2_FSIZE_MASK) /*!< SIM_SOPT2                               */
#define SIM_SOPT2_TSIEN_MASK                     (0x01UL << SIM_SOPT2_TSIEN_SHIFT)                   /*!< SIM_SOPT2: TSIEN Mask                   */
#define SIM_SOPT2_TSIEN_SHIFT                    28                                                  /*!< SIM_SOPT2: TSIEN Position               */
#define SIM_SOPT2_MAXCLK_MASK                    (0x01UL << SIM_SOPT2_MAXCLK_SHIFT)                  /*!< SIM_SOPT2: MAXCLK Mask                  */
#define SIM_SOPT2_MAXCLK_SHIFT                   29                                                  /*!< SIM_SOPT2: MAXCLK Position              */
/* ------- SOPT3 Bit Fields                         ------ */
#define SIM_SOPT3_FTM0_PDB_MASK                  (0x0FUL << SIM_SOPT3_FTM0_PDB_SHIFT)                /*!< SIM_SOPT3: FTM0_PDB Mask                */
#define SIM_SOPT3_FTM0_PDB_SHIFT                 0                                                   /*!< SIM_SOPT3: FTM0_PDB Position            */
#define SIM_SOPT3_FTM0_PDB(x)                    (((uint32_t)(((uint32_t)(x))<<SIM_SOPT3_FTM0_PDB_SHIFT))&SIM_SOPT3_FTM0_PDB_MASK) /*!< SIM_SOPT3                               */
#define SIM_SOPT3_FTM1_PDB_MASK                  (0x0FUL << SIM_SOPT3_FTM1_PDB_SHIFT)                /*!< SIM_SOPT3: FTM1_PDB Mask                */
#define SIM_SOPT3_FTM1_PDB_SHIFT                 4                                                   /*!< SIM_SOPT3: FTM1_PDB Position            */
#define SIM_SOPT3_FTM1_PDB(x)                    (((uint32_t)(((uint32_t)(x))<<SIM_SOPT3_FTM1_PDB_SHIFT))&SIM_SOPT3_FTM1_PDB_MASK) /*!< SIM_SOPT3                               */
#define SIM_SOPT3_FTM2_PDB_MASK                  (0x0FUL << SIM_SOPT3_FTM2_PDB_SHIFT)                /*!< SIM_SOPT3: FTM2_PDB Mask                */
#define SIM_SOPT3_FTM2_PDB_SHIFT                 8                                                   /*!< SIM_SOPT3: FTM2_PDB Position            */
#define SIM_SOPT3_FTM2_PDB(x)                    (((uint32_t)(((uint32_t)(x))<<SIM_SOPT3_FTM2_PDB_SHIFT))&SIM_SOPT3_FTM2_PDB_MASK) /*!< SIM_SOPT3                               */
#define SIM_SOPT3_FTM3_PDB_MASK                  (0x0FUL << SIM_SOPT3_FTM3_PDB_SHIFT)                /*!< SIM_SOPT3: FTM3_PDB Mask                */
#define SIM_SOPT3_FTM3_PDB_SHIFT                 12                                                  /*!< SIM_SOPT3: FTM3_PDB Position            */
#define SIM_SOPT3_FTM3_PDB(x)                    (((uint32_t)(((uint32_t)(x))<<SIM_SOPT3_FTM3_PDB_SHIFT))&SIM_SOPT3_FTM3_PDB_MASK) /*!< SIM_SOPT3                               */
#define SIM_SOPT3_FTM_SYNC0_MASK                 (0x01UL << SIM_SOPT3_FTM_SYNC0_SHIFT)               /*!< SIM_SOPT3: FTM_SYNC0 Mask               */
#define SIM_SOPT3_FTM_SYNC0_SHIFT                16                                                  /*!< SIM_SOPT3: FTM_SYNC0 Position           */
#define SIM_SOPT3_FTM_SYNC1_MASK                 (0x01UL << SIM_SOPT3_FTM_SYNC1_SHIFT)               /*!< SIM_SOPT3: FTM_SYNC1 Mask               */
#define SIM_SOPT3_FTM_SYNC1_SHIFT                17                                                  /*!< SIM_SOPT3: FTM_SYNC1 Position           */
#define SIM_SOPT3_FTM_SYNC2_MASK                 (0x01UL << SIM_SOPT3_FTM_SYNC2_SHIFT)               /*!< SIM_SOPT3: FTM_SYNC2 Mask               */
#define SIM_SOPT3_FTM_SYNC2_SHIFT                18                                                  /*!< SIM_SOPT3: FTM_SYNC2 Position           */
#define SIM_SOPT3_FTM_SYNC3_MASK                 (0x01UL << SIM_SOPT3_FTM_SYNC3_SHIFT)               /*!< SIM_SOPT3: FTM_SYNC3 Mask               */
#define SIM_SOPT3_FTM_SYNC3_SHIFT                19                                                  /*!< SIM_SOPT3: FTM_SYNC3 Position           */
/* ------- SOPT4 Bit Fields                         ------ */
#define SIM_SOPT4_FTM0FLT0_MASK                  (0x01UL << SIM_SOPT4_FTM0FLT0_SHIFT)                /*!< SIM_SOPT4: FTM0FLT0 Mask                */
#define SIM_SOPT4_FTM0FLT0_SHIFT                 0                                                   /*!< SIM_SOPT4: FTM0FLT0 Position            */
#define SIM_SOPT4_FTM0FLT1_MASK                  (0x01UL << SIM_SOPT4_FTM0FLT1_SHIFT)                /*!< SIM_SOPT4: FTM0FLT1 Mask                */
#define SIM_SOPT4_FTM0FLT1_SHIFT                 1                                                   /*!< SIM_SOPT4: FTM0FLT1 Position            */
#define SIM_SOPT4_FTM0FLT2_MASK                  (0x01UL << SIM_SOPT4_FTM0FLT2_SHIFT)                /*!< SIM_SOPT4: FTM0FLT2 Mask                */
#define SIM_SOPT4_FTM0FLT2_SHIFT                 2                                                   /*!< SIM_SOPT4: FTM0FLT2 Position            */
#define SIM_SOPT4_FTM0FLT3_MASK                  (0x01UL << SIM_SOPT4_FTM0FLT3_SHIFT)                /*!< SIM_SOPT4: FTM0FLT3 Mask                */
#define SIM_SOPT4_FTM0FLT3_SHIFT                 3                                                   /*!< SIM_SOPT4: FTM0FLT3 Position            */
#define SIM_SOPT4_FTM3FLT0_MASK                  (0x01UL << SIM_SOPT4_FTM3FLT0_SHIFT)                /*!< SIM_SOPT4: FTM3FLT0 Mask                */
#define SIM_SOPT4_FTM3FLT0_SHIFT                 12                                                  /*!< SIM_SOPT4: FTM3FLT0 Position            */
#define SIM_SOPT4_FTM3FLT1_MASK                  (0x01UL << SIM_SOPT4_FTM3FLT1_SHIFT)                /*!< SIM_SOPT4: FTM3FLT1 Mask                */
#define SIM_SOPT4_FTM3FLT1_SHIFT                 13                                                  /*!< SIM_SOPT4: FTM3FLT1 Position            */
#define SIM_SOPT4_FTM3FLT2_MASK                  (0x01UL << SIM_SOPT4_FTM3FLT2_SHIFT)                /*!< SIM_SOPT4: FTM3FLT2 Mask                */
#define SIM_SOPT4_FTM3FLT2_SHIFT                 14                                                  /*!< SIM_SOPT4: FTM3FLT2 Position            */
#define SIM_SOPT4_FTM3FLT3_MASK                  (0x01UL << SIM_SOPT4_FTM3FLT3_SHIFT)                /*!< SIM_SOPT4: FTM3FLT3 Mask                */
#define SIM_SOPT4_FTM3FLT3_SHIFT                 15                                                  /*!< SIM_SOPT4: FTM3FLT3 Position            */
#define SIM_SOPT4_FTM1CH0SRC_MASK                (0x03UL << SIM_SOPT4_FTM1CH0SRC_SHIFT)              /*!< SIM_SOPT4: FTM1CH0SRC Mask              */
#define SIM_SOPT4_FTM1CH0SRC_SHIFT               20                                                  /*!< SIM_SOPT4: FTM1CH0SRC Position          */
#define SIM_SOPT4_FTM1CH0SRC(x)                  (((uint32_t)(((uint32_t)(x))<<SIM_SOPT4_FTM1CH0SRC_SHIFT))&SIM_SOPT4_FTM1CH0SRC_MASK) /*!< SIM_SOPT4                               */
#define SIM_SOPT4_FTM2CH0SRC_MASK                (0x03UL << SIM_SOPT4_FTM2CH0SRC_SHIFT)              /*!< SIM_SOPT4: FTM2CH0SRC Mask              */
#define SIM_SOPT4_FTM2CH0SRC_SHIFT               22                                                  /*!< SIM_SOPT4: FTM2CH0SRC Position          */
#define SIM_SOPT4_FTM2CH0SRC(x)                  (((uint32_t)(((uint32_t)(x))<<SIM_SOPT4_FTM2CH0SRC_SHIFT))&SIM_SOPT4_FTM2CH0SRC_MASK) /*!< SIM_SOPT4                               */
#define SIM_SOPT4_FTM0CLKSEL_MASK                (0x01UL << SIM_SOPT4_FTM0CLKSEL_SHIFT)              /*!< SIM_SOPT4: FTM0CLKSEL Mask              */
#define SIM_SOPT4_FTM0CLKSEL_SHIFT               24                                                  /*!< SIM_SOPT4: FTM0CLKSEL Position          */
#define SIM_SOPT4_FTM1CLKSEL_MASK                (0x01UL << SIM_SOPT4_FTM1CLKSEL_SHIFT)              /*!< SIM_SOPT4: FTM1CLKSEL Mask              */
#define SIM_SOPT4_FTM1CLKSEL_SHIFT               25                                                  /*!< SIM_SOPT4: FTM1CLKSEL Position          */
#define SIM_SOPT4_FTM2CLKSEL_MASK                (0x01UL << SIM_SOPT4_FTM2CLKSEL_SHIFT)              /*!< SIM_SOPT4: FTM2CLKSEL Mask              */
#define SIM_SOPT4_FTM2CLKSEL_SHIFT               26                                                  /*!< SIM_SOPT4: FTM2CLKSEL Position          */
#define SIM_SOPT4_FTM3CLKSEL_MASK                (0x01UL << SIM_SOPT4_FTM3CLKSEL_SHIFT)              /*!< SIM_SOPT4: FTM3CLKSEL Mask              */
#define SIM_SOPT4_FTM3CLKSEL_SHIFT               27                                                  /*!< SIM_SOPT4: FTM3CLKSEL Position          */
/* ------- SOPT5 Bit Fields                         ------ */
#define SIM_SOPT5_UART0TXSRC_MASK                (0x03UL << SIM_SOPT5_UART0TXSRC_SHIFT)              /*!< SIM_SOPT5: UART0TXSRC Mask              */
#define SIM_SOPT5_UART0TXSRC_SHIFT               0                                                   /*!< SIM_SOPT5: UART0TXSRC Position          */
#define SIM_SOPT5_UART0TXSRC(x)                  (((uint32_t)(((uint32_t)(x))<<SIM_SOPT5_UART0TXSRC_SHIFT))&SIM_SOPT5_UART0TXSRC_MASK) /*!< SIM_SOPT5                               */
#define SIM_SOPT5_UART0RXSRC_MASK                (0x03UL << SIM_SOPT5_UART0RXSRC_SHIFT)              /*!< SIM_SOPT5: UART0RXSRC Mask              */
#define SIM_SOPT5_UART0RXSRC_SHIFT               2                                                   /*!< SIM_SOPT5: UART0RXSRC Position          */
#define SIM_SOPT5_UART0RXSRC(x)                  (((uint32_t)(((uint32_t)(x))<<SIM_SOPT5_UART0RXSRC_SHIFT))&SIM_SOPT5_UART0RXSRC_MASK) /*!< SIM_SOPT5                               */
#define SIM_SOPT5_UART1TXSRC_MASK                (0x03UL << SIM_SOPT5_UART1TXSRC_SHIFT)              /*!< SIM_SOPT5: UART1TXSRC Mask              */
#define SIM_SOPT5_UART1TXSRC_SHIFT               4                                                   /*!< SIM_SOPT5: UART1TXSRC Position          */
#define SIM_SOPT5_UART1TXSRC(x)                  (((uint32_t)(((uint32_t)(x))<<SIM_SOPT5_UART1TXSRC_SHIFT))&SIM_SOPT5_UART1TXSRC_MASK) /*!< SIM_SOPT5                               */
#define SIM_SOPT5_UART1RXSRC_MASK                (0x03UL << SIM_SOPT5_UART1RXSRC_SHIFT)              /*!< SIM_SOPT5: UART1RXSRC Mask              */
#define SIM_SOPT5_UART1RXSRC_SHIFT               6                                                   /*!< SIM_SOPT5: UART1RXSRC Position          */
#define SIM_SOPT5_UART1RXSRC(x)                  (((uint32_t)(((uint32_t)(x))<<SIM_SOPT5_UART1RXSRC_SHIFT))&SIM_SOPT5_UART1RXSRC_MASK) /*!< SIM_SOPT5                               */
/* ------- SOPT6 Bit Fields                         ------ */
#define SIM_SOPT6_CLKDIV_MASK                    (0x07UL << SIM_SOPT6_CLKDIV_SHIFT)                  /*!< SIM_SOPT6: CLKDIV Mask                  */
#define SIM_SOPT6_CLKDIV_SHIFT                   0                                                   /*!< SIM_SOPT6: CLKDIV Position              */
#define SIM_SOPT6_CLKDIV(x)                      (((uint32_t)(((uint32_t)(x))<<SIM_SOPT6_CLKDIV_SHIFT))&SIM_SOPT6_CLKDIV_MASK) /*!< SIM_SOPT6                               */
#define SIM_SOPT6_CLKOS_MASK                     (0x0FUL << SIM_SOPT6_CLKOS_SHIFT)                   /*!< SIM_SOPT6: CLKOS Mask                   */
#define SIM_SOPT6_CLKOS_SHIFT                    4                                                   /*!< SIM_SOPT6: CLKOS Position               */
#define SIM_SOPT6_CLKOS(x)                       (((uint32_t)(((uint32_t)(x))<<SIM_SOPT6_CLKOS_SHIFT))&SIM_SOPT6_CLKOS_MASK) /*!< SIM_SOPT6                               */
/* ------- SOPT7 Bit Fields                         ------ */
#define SIM_SOPT7_ADC0TRGSEL_MASK                (0x0FUL << SIM_SOPT7_ADC0TRGSEL_SHIFT)              /*!< SIM_SOPT7: ADC0TRGSEL Mask              */
#define SIM_SOPT7_ADC0TRGSEL_SHIFT               0                                                   /*!< SIM_SOPT7: ADC0TRGSEL Position          */
#define SIM_SOPT7_ADC0TRGSEL(x)                  (((uint32_t)(((uint32_t)(x))<<SIM_SOPT7_ADC0TRGSEL_SHIFT))&SIM_SOPT7_ADC0TRGSEL_MASK) /*!< SIM_SOPT7                               */
#define SIM_SOPT7_ADC1TRGSEL_MASK                (0x0FUL << SIM_SOPT7_ADC1TRGSEL_SHIFT)              /*!< SIM_SOPT7: ADC1TRGSEL Mask              */
#define SIM_SOPT7_ADC1TRGSEL_SHIFT               4                                                   /*!< SIM_SOPT7: ADC1TRGSEL Position          */
#define SIM_SOPT7_ADC1TRGSEL(x)                  (((uint32_t)(((uint32_t)(x))<<SIM_SOPT7_ADC1TRGSEL_SHIFT))&SIM_SOPT7_ADC1TRGSEL_MASK) /*!< SIM_SOPT7                               */
#define SIM_SOPT7_ADC2TRGSEL_MASK                (0x0FUL << SIM_SOPT7_ADC2TRGSEL_SHIFT)              /*!< SIM_SOPT7: ADC2TRGSEL Mask              */
#define SIM_SOPT7_ADC2TRGSEL_SHIFT               8                                                   /*!< SIM_SOPT7: ADC2TRGSEL Position          */
#define SIM_SOPT7_ADC2TRGSEL(x)                  (((uint32_t)(((uint32_t)(x))<<SIM_SOPT7_ADC2TRGSEL_SHIFT))&SIM_SOPT7_ADC2TRGSEL_MASK) /*!< SIM_SOPT7                               */
#define SIM_SOPT7_ADC3TRGSEL_MASK                (0x0FUL << SIM_SOPT7_ADC3TRGSEL_SHIFT)              /*!< SIM_SOPT7: ADC3TRGSEL Mask              */
#define SIM_SOPT7_ADC3TRGSEL_SHIFT               12                                                  /*!< SIM_SOPT7: ADC3TRGSEL Position          */
#define SIM_SOPT7_ADC3TRGSEL(x)                  (((uint32_t)(((uint32_t)(x))<<SIM_SOPT7_ADC3TRGSEL_SHIFT))&SIM_SOPT7_ADC3TRGSEL_MASK) /*!< SIM_SOPT7                               */
#define SIM_SOPT7_CMP0WS_MASK                    (0x03UL << SIM_SOPT7_CMP0WS_SHIFT)                  /*!< SIM_SOPT7: CMP0WS Mask                  */
#define SIM_SOPT7_CMP0WS_SHIFT                   16                                                  /*!< SIM_SOPT7: CMP0WS Position              */
#define SIM_SOPT7_CMP0WS(x)                      (((uint32_t)(((uint32_t)(x))<<SIM_SOPT7_CMP0WS_SHIFT))&SIM_SOPT7_CMP0WS_MASK) /*!< SIM_SOPT7                               */
#define SIM_SOPT7_CMP1WS_MASK                    (0x03UL << SIM_SOPT7_CMP1WS_SHIFT)                  /*!< SIM_SOPT7: CMP1WS Mask                  */
#define SIM_SOPT7_CMP1WS_SHIFT                   18                                                  /*!< SIM_SOPT7: CMP1WS Position              */
#define SIM_SOPT7_CMP1WS(x)                      (((uint32_t)(((uint32_t)(x))<<SIM_SOPT7_CMP1WS_SHIFT))&SIM_SOPT7_CMP1WS_MASK) /*!< SIM_SOPT7                               */
#define SIM_SOPT7_CMP2WS_MASK                    (0x03UL << SIM_SOPT7_CMP2WS_SHIFT)                  /*!< SIM_SOPT7: CMP2WS Mask                  */
#define SIM_SOPT7_CMP2WS_SHIFT                   20                                                  /*!< SIM_SOPT7: CMP2WS Position              */
#define SIM_SOPT7_CMP2WS(x)                      (((uint32_t)(((uint32_t)(x))<<SIM_SOPT7_CMP2WS_SHIFT))&SIM_SOPT7_CMP2WS_MASK) /*!< SIM_SOPT7                               */
#define SIM_SOPT7_CMP3WS_MASK                    (0x03UL << SIM_SOPT7_CMP3WS_SHIFT)                  /*!< SIM_SOPT7: CMP3WS Mask                  */
#define SIM_SOPT7_CMP3WS_SHIFT                   22                                                  /*!< SIM_SOPT7: CMP3WS Position              */
#define SIM_SOPT7_CMP3WS(x)                      (((uint32_t)(((uint32_t)(x))<<SIM_SOPT7_CMP3WS_SHIFT))&SIM_SOPT7_CMP3WS_MASK) /*!< SIM_SOPT7                               */
#define SIM_SOPT7_ADC0ALTTRGEN_MASK              (0x01UL << SIM_SOPT7_ADC0ALTTRGEN_SHIFT)            /*!< SIM_SOPT7: ADC0ALTTRGEN Mask            */
#define SIM_SOPT7_ADC0ALTTRGEN_SHIFT             28                                                  /*!< SIM_SOPT7: ADC0ALTTRGEN Position        */
#define SIM_SOPT7_ADC1ALTTRGEN_MASK              (0x01UL << SIM_SOPT7_ADC1ALTTRGEN_SHIFT)            /*!< SIM_SOPT7: ADC1ALTTRGEN Mask            */
#define SIM_SOPT7_ADC1ALTTRGEN_SHIFT             29                                                  /*!< SIM_SOPT7: ADC1ALTTRGEN Position        */
#define SIM_SOPT7_ADC2ALTTRGEN_MASK              (0x01UL << SIM_SOPT7_ADC2ALTTRGEN_SHIFT)            /*!< SIM_SOPT7: ADC2ALTTRGEN Mask            */
#define SIM_SOPT7_ADC2ALTTRGEN_SHIFT             30                                                  /*!< SIM_SOPT7: ADC2ALTTRGEN Position        */
#define SIM_SOPT7_ADC3ALTTRGEN_MASK              (0x01UL << SIM_SOPT7_ADC3ALTTRGEN_SHIFT)            /*!< SIM_SOPT7: ADC3ALTTRGEN Mask            */
#define SIM_SOPT7_ADC3ALTTRGEN_SHIFT             31                                                  /*!< SIM_SOPT7: ADC3ALTTRGEN Position        */
/* ------- SDID Bit Fields                          ------ */
#define SIM_SDID_BOID_MASK                       (0x0FUL << SIM_SDID_BOID_SHIFT)                     /*!< SIM_SDID: BOID Mask                     */
#define SIM_SDID_BOID_SHIFT                      0                                                   /*!< SIM_SDID: BOID Position                 */
#define SIM_SDID_BOID(x)                         (((uint32_t)(((uint32_t)(x))<<SIM_SDID_BOID_SHIFT))&SIM_SDID_BOID_MASK) /*!< SIM_SDID                                */
#define SIM_SDID_DIEID_MASK                      (0x03UL << SIM_SDID_DIEID_SHIFT)                    /*!< SIM_SDID: DIEID Mask                    */
#define SIM_SDID_DIEID_SHIFT                     4                                                   /*!< SIM_SDID: DIEID Position                */
#define SIM_SDID_DIEID(x)                        (((uint32_t)(((uint32_t)(x))<<SIM_SDID_DIEID_SHIFT))&SIM_SDID_DIEID_MASK) /*!< SIM_SDID                                */
#define SIM_SDID_REVID_MASK                      (0x0FUL << SIM_SDID_REVID_SHIFT)                    /*!< SIM_SDID: REVID Mask                    */
#define SIM_SDID_REVID_SHIFT                     12                                                  /*!< SIM_SDID: REVID Position                */
#define SIM_SDID_REVID(x)                        (((uint32_t)(((uint32_t)(x))<<SIM_SDID_REVID_SHIFT))&SIM_SDID_REVID_MASK) /*!< SIM_SDID                                */
/* ------- SCGC5 Bit Fields                         ------ */
#define SIM_SCGC5_EWM_MASK                       (0x01UL << SIM_SCGC5_EWM_SHIFT)                     /*!< SIM_SCGC5: EWM Mask                     */
#define SIM_SCGC5_EWM_SHIFT                      1                                                   /*!< SIM_SCGC5: EWM Position                 */
#define SIM_SCGC5_CMT_MASK                       (0x01UL << SIM_SCGC5_CMT_SHIFT)                     /*!< SIM_SCGC5: CMT Mask                     */
#define SIM_SCGC5_CMT_SHIFT                      2                                                   /*!< SIM_SCGC5: CMT Position                 */
#define SIM_SCGC5_IIC0_MASK                      (0x01UL << SIM_SCGC5_IIC0_SHIFT)                    /*!< SIM_SCGC5: IIC0 Mask                    */
