podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MKE14D7.h
#define SIM_SCGC5_IIC0_SHIFT                     7                                                   /*!< SIM_SCGC5: IIC0 Position                */
#define SIM_SCGC5_IIC1_MASK                      (0x01UL << SIM_SCGC5_IIC1_SHIFT)                    /*!< SIM_SCGC5: IIC1 Mask                    */
#define SIM_SCGC5_IIC1_SHIFT                     8                                                   /*!< SIM_SCGC5: IIC1 Position                */
#define SIM_SCGC5_UART0_MASK                     (0x01UL << SIM_SCGC5_UART0_SHIFT)                   /*!< SIM_SCGC5: UART0 Mask                   */
#define SIM_SCGC5_UART0_SHIFT                    9                                                   /*!< SIM_SCGC5: UART0 Position               */
#define SIM_SCGC5_UART1_MASK                     (0x01UL << SIM_SCGC5_UART1_SHIFT)                   /*!< SIM_SCGC5: UART1 Mask                   */
#define SIM_SCGC5_UART1_SHIFT                    10                                                  /*!< SIM_SCGC5: UART1 Position               */
#define SIM_SCGC5_UART2_MASK                     (0x01UL << SIM_SCGC5_UART2_SHIFT)                   /*!< SIM_SCGC5: UART2 Mask                   */
#define SIM_SCGC5_UART2_SHIFT                    11                                                  /*!< SIM_SCGC5: UART2 Position               */
#define SIM_SCGC5_UART3_MASK                     (0x01UL << SIM_SCGC5_UART3_SHIFT)                   /*!< SIM_SCGC5: UART3 Mask                   */
#define SIM_SCGC5_UART3_SHIFT                    12                                                  /*!< SIM_SCGC5: UART3 Position               */
#define SIM_SCGC5_SPI0_MASK                      (0x01UL << SIM_SCGC5_SPI0_SHIFT)                    /*!< SIM_SCGC5: SPI0 Mask                    */
#define SIM_SCGC5_SPI0_SHIFT                     14                                                  /*!< SIM_SCGC5: SPI0 Position                */
#define SIM_SCGC5_SPI1_MASK                      (0x01UL << SIM_SCGC5_SPI1_SHIFT)                    /*!< SIM_SCGC5: SPI1 Mask                    */
#define SIM_SCGC5_SPI1_SHIFT                     15                                                  /*!< SIM_SCGC5: SPI1 Position                */
#define SIM_SCGC5_ACMP0_MASK                     (0x01UL << SIM_SCGC5_ACMP0_SHIFT)                   /*!< SIM_SCGC5: ACMP0 Mask                   */
#define SIM_SCGC5_ACMP0_SHIFT                    16                                                  /*!< SIM_SCGC5: ACMP0 Position               */
#define SIM_SCGC5_ACMP1_MASK                     (0x01UL << SIM_SCGC5_ACMP1_SHIFT)                   /*!< SIM_SCGC5: ACMP1 Mask                   */
#define SIM_SCGC5_ACMP1_SHIFT                    17                                                  /*!< SIM_SCGC5: ACMP1 Position               */
#define SIM_SCGC5_ACMP2_MASK                     (0x01UL << SIM_SCGC5_ACMP2_SHIFT)                   /*!< SIM_SCGC5: ACMP2 Mask                   */
#define SIM_SCGC5_ACMP2_SHIFT                    18                                                  /*!< SIM_SCGC5: ACMP2 Position               */
#define SIM_SCGC5_ACMP3_MASK                     (0x01UL << SIM_SCGC5_ACMP3_SHIFT)                   /*!< SIM_SCGC5: ACMP3 Mask                   */
#define SIM_SCGC5_ACMP3_SHIFT                    19                                                  /*!< SIM_SCGC5: ACMP3 Position               */
/* ------- SCGC6 Bit Fields                         ------ */
#define SIM_SCGC6_DMAMUX0_MASK                   (0x01UL << SIM_SCGC6_DMAMUX0_SHIFT)                 /*!< SIM_SCGC6: DMAMUX0 Mask                 */
#define SIM_SCGC6_DMAMUX0_SHIFT                  1                                                   /*!< SIM_SCGC6: DMAMUX0 Position             */
#define SIM_SCGC6_PIT_MASK                       (0x01UL << SIM_SCGC6_PIT_SHIFT)                     /*!< SIM_SCGC6: PIT Mask                     */
#define SIM_SCGC6_PIT_SHIFT                      3                                                   /*!< SIM_SCGC6: PIT Position                 */
#define SIM_SCGC6_CRC_MASK                       (0x01UL << SIM_SCGC6_CRC_SHIFT)                     /*!< SIM_SCGC6: CRC Mask                     */
#define SIM_SCGC6_CRC_SHIFT                      4                                                   /*!< SIM_SCGC6: CRC Position                 */
#define SIM_SCGC6_PDB0_MASK                      (0x01UL << SIM_SCGC6_PDB0_SHIFT)                    /*!< SIM_SCGC6: PDB0 Mask                    */
#define SIM_SCGC6_PDB0_SHIFT                     5                                                   /*!< SIM_SCGC6: PDB0 Position                */
#define SIM_SCGC6_PDB1_MASK                      (0x01UL << SIM_SCGC6_PDB1_SHIFT)                    /*!< SIM_SCGC6: PDB1 Mask                    */
#define SIM_SCGC6_PDB1_SHIFT                     6                                                   /*!< SIM_SCGC6: PDB1 Position                */
#define SIM_SCGC6_PDB2_MASK                      (0x01UL << SIM_SCGC6_PDB2_SHIFT)                    /*!< SIM_SCGC6: PDB2 Mask                    */
#define SIM_SCGC6_PDB2_SHIFT                     7                                                   /*!< SIM_SCGC6: PDB2 Position                */
#define SIM_SCGC6_PDB3_MASK                      (0x01UL << SIM_SCGC6_PDB3_SHIFT)                    /*!< SIM_SCGC6: PDB3 Mask                    */
#define SIM_SCGC6_PDB3_SHIFT                     8                                                   /*!< SIM_SCGC6: PDB3 Position                */
#define SIM_SCGC6_FTM0_MASK                      (0x01UL << SIM_SCGC6_FTM0_SHIFT)                    /*!< SIM_SCGC6: FTM0 Mask                    */
#define SIM_SCGC6_FTM0_SHIFT                     9                                                   /*!< SIM_SCGC6: FTM0 Position                */
#define SIM_SCGC6_FTM1_MASK                      (0x01UL << SIM_SCGC6_FTM1_SHIFT)                    /*!< SIM_SCGC6: FTM1 Mask                    */
#define SIM_SCGC6_FTM1_SHIFT                     10                                                  /*!< SIM_SCGC6: FTM1 Position                */
#define SIM_SCGC6_FTM2_MASK                      (0x01UL << SIM_SCGC6_FTM2_SHIFT)                    /*!< SIM_SCGC6: FTM2 Mask                    */
#define SIM_SCGC6_FTM2_SHIFT                     11                                                  /*!< SIM_SCGC6: FTM2 Position                */
#define SIM_SCGC6_FTM3_MASK                      (0x01UL << SIM_SCGC6_FTM3_SHIFT)                    /*!< SIM_SCGC6: FTM3 Mask                    */
#define SIM_SCGC6_FTM3_SHIFT                     12                                                  /*!< SIM_SCGC6: FTM3 Position                */
#define SIM_SCGC6_RTC_MASK                       (0x01UL << SIM_SCGC6_RTC_SHIFT)                     /*!< SIM_SCGC6: RTC Mask                     */
#define SIM_SCGC6_RTC_SHIFT                      13                                                  /*!< SIM_SCGC6: RTC Position                 */
#define SIM_SCGC6_TSI_MASK                       (0x01UL << SIM_SCGC6_TSI_SHIFT)                     /*!< SIM_SCGC6: TSI Mask                     */
#define SIM_SCGC6_TSI_SHIFT                      16                                                  /*!< SIM_SCGC6: TSI Position                 */
#define SIM_SCGC6_PORTA_MASK                     (0x01UL << SIM_SCGC6_PORTA_SHIFT)                   /*!< SIM_SCGC6: PORTA Mask                   */
#define SIM_SCGC6_PORTA_SHIFT                    19                                                  /*!< SIM_SCGC6: PORTA Position               */
#define SIM_SCGC6_PORTB_MASK                     (0x01UL << SIM_SCGC6_PORTB_SHIFT)                   /*!< SIM_SCGC6: PORTB Mask                   */
#define SIM_SCGC6_PORTB_SHIFT                    20                                                  /*!< SIM_SCGC6: PORTB Position               */
#define SIM_SCGC6_PORTC_MASK                     (0x01UL << SIM_SCGC6_PORTC_SHIFT)                   /*!< SIM_SCGC6: PORTC Mask                   */
#define SIM_SCGC6_PORTC_SHIFT                    21                                                  /*!< SIM_SCGC6: PORTC Position               */
#define SIM_SCGC6_PORTD_MASK                     (0x01UL << SIM_SCGC6_PORTD_SHIFT)                   /*!< SIM_SCGC6: PORTD Mask                   */
#define SIM_SCGC6_PORTD_SHIFT                    22                                                  /*!< SIM_SCGC6: PORTD Position               */
#define SIM_SCGC6_PORTE_MASK                     (0x01UL << SIM_SCGC6_PORTE_SHIFT)                   /*!< SIM_SCGC6: PORTE Mask                   */
#define SIM_SCGC6_PORTE_SHIFT                    23                                                  /*!< SIM_SCGC6: PORTE Position               */
#define SIM_SCGC6_ADC0_MASK                      (0x01UL << SIM_SCGC6_ADC0_SHIFT)                    /*!< SIM_SCGC6: ADC0 Mask                    */
#define SIM_SCGC6_ADC0_SHIFT                     27                                                  /*!< SIM_SCGC6: ADC0 Position                */
#define SIM_SCGC6_ADC1_MASK                      (0x01UL << SIM_SCGC6_ADC1_SHIFT)                    /*!< SIM_SCGC6: ADC1 Mask                    */
#define SIM_SCGC6_ADC1_SHIFT                     28                                                  /*!< SIM_SCGC6: ADC1 Position                */
#define SIM_SCGC6_ADC2_MASK                      (0x01UL << SIM_SCGC6_ADC2_SHIFT)                    /*!< SIM_SCGC6: ADC2 Mask                    */
#define SIM_SCGC6_ADC2_SHIFT                     29                                                  /*!< SIM_SCGC6: ADC2 Position                */
#define SIM_SCGC6_ADC3_MASK                      (0x01UL << SIM_SCGC6_ADC3_SHIFT)                    /*!< SIM_SCGC6: ADC3 Mask                    */
#define SIM_SCGC6_ADC3_SHIFT                     30                                                  /*!< SIM_SCGC6: ADC3 Position                */
/* ------- SCGC7 Bit Fields                         ------ */
#define SIM_SCGC7_FLEXBUS_MASK                   (0x01UL << SIM_SCGC7_FLEXBUS_SHIFT)                 /*!< SIM_SCGC7: FLEXBUS Mask                 */
#define SIM_SCGC7_FLEXBUS_SHIFT                  0                                                   /*!< SIM_SCGC7: FLEXBUS Position             */
#define SIM_SCGC7_DMA_MASK                       (0x01UL << SIM_SCGC7_DMA_SHIFT)                     /*!< SIM_SCGC7: DMA Mask                     */
#define SIM_SCGC7_DMA_SHIFT                      1                                                   /*!< SIM_SCGC7: DMA Position                 */
#define SIM_SCGC7_MPU_MASK                       (0x01UL << SIM_SCGC7_MPU_SHIFT)                     /*!< SIM_SCGC7: MPU Mask                     */
#define SIM_SCGC7_MPU_SHIFT                      2                                                   /*!< SIM_SCGC7: MPU Position                 */
#define SIM_SCGC7_IEVT_MASK                      (0x01UL << SIM_SCGC7_IEVT_SHIFT)                    /*!< SIM_SCGC7: IEVT Mask                    */
#define SIM_SCGC7_IEVT_SHIFT                     3                                                   /*!< SIM_SCGC7: IEVT Position                */
/* ------- CLKDIV1 Bit Fields                       ------ */
#define SIM_CLKDIV1_OUTDIV5_MASK                 (0x03UL << SIM_CLKDIV1_OUTDIV5_SHIFT)               /*!< SIM_CLKDIV1: OUTDIV5 Mask               */
#define SIM_CLKDIV1_OUTDIV5_SHIFT                12                                                  /*!< SIM_CLKDIV1: OUTDIV5 Position           */
#define SIM_CLKDIV1_OUTDIV5(x)                   (((uint32_t)(((uint32_t)(x))<<SIM_CLKDIV1_OUTDIV5_SHIFT))&SIM_CLKDIV1_OUTDIV5_MASK) /*!< SIM_CLKDIV1                             */
#define SIM_CLKDIV1_OUTDIV4_MASK                 (0x03UL << SIM_CLKDIV1_OUTDIV4_SHIFT)               /*!< SIM_CLKDIV1: OUTDIV4 Mask               */
#define SIM_CLKDIV1_OUTDIV4_SHIFT                16                                                  /*!< SIM_CLKDIV1: OUTDIV4 Position           */
#define SIM_CLKDIV1_OUTDIV4(x)                   (((uint32_t)(((uint32_t)(x))<<SIM_CLKDIV1_OUTDIV4_SHIFT))&SIM_CLKDIV1_OUTDIV4_MASK) /*!< SIM_CLKDIV1                             */
#define SIM_CLKDIV1_OUTDIV3_MASK                 (0x03UL << SIM_CLKDIV1_OUTDIV3_SHIFT)               /*!< SIM_CLKDIV1: OUTDIV3 Mask               */
#define SIM_CLKDIV1_OUTDIV3_SHIFT                20                                                  /*!< SIM_CLKDIV1: OUTDIV3 Position           */
#define SIM_CLKDIV1_OUTDIV3(x)                   (((uint32_t)(((uint32_t)(x))<<SIM_CLKDIV1_OUTDIV3_SHIFT))&SIM_CLKDIV1_OUTDIV3_MASK) /*!< SIM_CLKDIV1                             */
#define SIM_CLKDIV1_OUTDIV2_MASK                 (0x03UL << SIM_CLKDIV1_OUTDIV2_SHIFT)               /*!< SIM_CLKDIV1: OUTDIV2 Mask               */
#define SIM_CLKDIV1_OUTDIV2_SHIFT                24                                                  /*!< SIM_CLKDIV1: OUTDIV2 Position           */
#define SIM_CLKDIV1_OUTDIV2(x)                   (((uint32_t)(((uint32_t)(x))<<SIM_CLKDIV1_OUTDIV2_SHIFT))&SIM_CLKDIV1_OUTDIV2_MASK) /*!< SIM_CLKDIV1                             */
#define SIM_CLKDIV1_OUTDIV1_MASK                 (0x03UL << SIM_CLKDIV1_OUTDIV1_SHIFT)               /*!< SIM_CLKDIV1: OUTDIV1 Mask               */
#define SIM_CLKDIV1_OUTDIV1_SHIFT                28                                                  /*!< SIM_CLKDIV1: OUTDIV1 Position           */
#define SIM_CLKDIV1_OUTDIV1(x)                   (((uint32_t)(((uint32_t)(x))<<SIM_CLKDIV1_OUTDIV1_SHIFT))&SIM_CLKDIV1_OUTDIV1_MASK) /*!< SIM_CLKDIV1                             */
/* ------- UIDH Bit Fields                          ------ */
#define SIM_UIDH_UID_MASK                        (0xFFFFFFFFUL << SIM_UIDH_UID_SHIFT)                /*!< SIM_UIDH: UID Mask                      */
#define SIM_UIDH_UID_SHIFT                       0                                                   /*!< SIM_UIDH: UID Position                  */
#define SIM_UIDH_UID(x)                          (((uint32_t)(((uint32_t)(x))<<SIM_UIDH_UID_SHIFT))&SIM_UIDH_UID_MASK) /*!< SIM_UIDH                                */
/* ------- UIDMH Bit Fields                         ------ */
#define SIM_UIDMH_UID_MASK                       (0xFFFFFFFFUL << SIM_UIDMH_UID_SHIFT)               /*!< SIM_UIDMH: UID Mask                     */
#define SIM_UIDMH_UID_SHIFT                      0                                                   /*!< SIM_UIDMH: UID Position                 */
#define SIM_UIDMH_UID(x)                         (((uint32_t)(((uint32_t)(x))<<SIM_UIDMH_UID_SHIFT))&SIM_UIDMH_UID_MASK) /*!< SIM_UIDMH                               */
/* ------- UIDML Bit Fields                         ------ */
#define SIM_UIDML_UID_MASK                       (0xFFFFFFFFUL << SIM_UIDML_UID_SHIFT)               /*!< SIM_UIDML: UID Mask                     */
#define SIM_UIDML_UID_SHIFT                      0                                                   /*!< SIM_UIDML: UID Position                 */
#define SIM_UIDML_UID(x)                         (((uint32_t)(((uint32_t)(x))<<SIM_UIDML_UID_SHIFT))&SIM_UIDML_UID_MASK) /*!< SIM_UIDML                               */
/* ------- UIDL Bit Fields                          ------ */
#define SIM_UIDL_UID_MASK                        (0xFFFFFFFFUL << SIM_UIDL_UID_SHIFT)                /*!< SIM_UIDL: UID Mask                      */
#define SIM_UIDL_UID_SHIFT                       0                                                   /*!< SIM_UIDL: UID Position                  */
#define SIM_UIDL_UID(x)                          (((uint32_t)(((uint32_t)(x))<<SIM_UIDL_UID_SHIFT))&SIM_UIDL_UID_MASK) /*!< SIM_UIDL                                */
/**
 * @} */ /* End group SIM_Register_Masks_GROUP 
 */

/* SIM - Peripheral instance base addresses */
#define SIM_BasePtr                    0x40032000UL //!< Peripheral base address
#define SIM                            ((SIM_Type *) SIM_BasePtr) //!< Freescale base pointer
#define SIM_BASE_PTR                   (SIM) //!< Freescale style base pointer
/**
 * @} */ /* End group SIM_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup SMC_Peripheral_access_layer_GROUP SMC Peripheral Access Layer
* @brief C Struct for SMC
* @{
*/

/* ================================================================================ */
/* ================           SMC (file:SMC_MKE14D7)               ================ */
/* ================================================================================ */

/**
 * @brief System mode controller
 */
/**
* @addtogroup SMC_structs_GROUP SMC struct
* @brief Struct for SMC
* @{
*/
typedef struct {                                /*       SMC Structure                                                */
   __IO uint8_t   PMPROT;                       /**< 0000: SMC Power Mode Protection Register                           */
   __IO uint8_t   PMCTRL;                       /**< 0001: SMC Power Mode Control Register                              */
   __I  uint8_t   RESERVED0;                   
   __I  uint8_t   PMSTAT;                       /**< 0003: SMC Power Mode Status Register                               */
} SMC_Type;

/**
 * @} */ /* End group SMC_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'SMC' Position & Mask macros                         ----------- */
/* -------------------------------------------------------------------------------- */

/**
* @addtogroup SMC_Register_Masks_GROUP SMC Register Masks
* @brief Register Masks for SMC
* @{
*/
/* ------- PMPROT Bit Fields                        ------ */
#define SMC_PMPROT_AVLP_MASK                     (0x01UL << SMC_PMPROT_AVLP_SHIFT)                   /*!< SMC_PMPROT: AVLP Mask                   */
#define SMC_PMPROT_AVLP_SHIFT                    5                                                   /*!< SMC_PMPROT: AVLP Position               */
/* ------- PMCTRL Bit Fields                        ------ */
#define SMC_PMCTRL_STOPM_MASK                    (0x07UL << SMC_PMCTRL_STOPM_SHIFT)                  /*!< SMC_PMCTRL: STOPM Mask                  */
#define SMC_PMCTRL_STOPM_SHIFT                   0                                                   /*!< SMC_PMCTRL: STOPM Position              */
#define SMC_PMCTRL_STOPM(x)                      (((uint8_t)(((uint8_t)(x))<<SMC_PMCTRL_STOPM_SHIFT))&SMC_PMCTRL_STOPM_MASK) /*!< SMC_PMCTRL                              */
#define SMC_PMCTRL_STOPA_MASK                    (0x01UL << SMC_PMCTRL_STOPA_SHIFT)                  /*!< SMC_PMCTRL: STOPA Mask                  */
#define SMC_PMCTRL_STOPA_SHIFT                   3                                                   /*!< SMC_PMCTRL: STOPA Position              */
/* ------- PMSTAT Bit Fields                        ------ */
#define SMC_PMSTAT_RUN_MASK                      (0x01UL << SMC_PMSTAT_RUN_SHIFT)                    /*!< SMC_PMSTAT: RUN Mask                    */
#define SMC_PMSTAT_RUN_SHIFT                     0                                                   /*!< SMC_PMSTAT: RUN Position                */
#define SMC_PMSTAT_STOP_MASK                     (0x01UL << SMC_PMSTAT_STOP_SHIFT)                   /*!< SMC_PMSTAT: STOP Mask                   */
#define SMC_PMSTAT_STOP_SHIFT                    1                                                   /*!< SMC_PMSTAT: STOP Position               */
#define SMC_PMSTAT_VLPS_MASK                     (0x01UL << SMC_PMSTAT_VLPS_SHIFT)                   /*!< SMC_PMSTAT: VLPS Mask                   */
#define SMC_PMSTAT_VLPS_SHIFT                    4                                                   /*!< SMC_PMSTAT: VLPS Position               */
/**
 * @} */ /* End group SMC_Register_Masks_GROUP 
 */

/* SMC - Peripheral instance base addresses */
#define SMC_BasePtr                    0x40056000UL //!< Peripheral base address
#define SMC                            ((SMC_Type *) SMC_BasePtr) //!< Freescale base pointer
#define SMC_BASE_PTR                   (SMC) //!< Freescale style base pointer
/**
 * @} */ /* End group SMC_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup SPI_Peripheral_access_layer_GROUP SPI Peripheral Access Layer
* @brief C Struct for SPI
* @{
*/

/* ================================================================================ */
/* ================           SPI0 (file:SPI0_MKE14D7)             ================ */
/* ================================================================================ */

/**
 * @brief Serial Peripheral Interface
 */
/**
* @addtogroup SPI_structs_GROUP SPI struct
* @brief Struct for SPI
* @{
*/
typedef struct {                                /*       SPI0 Structure                                               */
   __IO uint8_t   C1;                           /**< 0000: Control register 1                                           */
   __IO uint8_t   C2;                           /**< 0001: Control register 2                                           */
   __IO uint8_t   BR;                           /**< 0002: Baud rate register                                           */
   __I  uint8_t   S;                            /**< 0003: Status register                                              */
   __IO uint8_t   DH;                           /**< 0004: Data register high                                           */
   __IO uint8_t   DL;                           /**< 0005: Data register low                                            */
   __IO uint8_t   MH;                           /**< 0006: Match register high                                          */
   __IO uint8_t   ML;                           /**< 0007: Match register low                                           */
   __IO uint8_t   C3;                           /**< 0008: Control register 3                                           */
   __IO uint8_t   CI;                           /**< 0009: Clear interrupt register                                     */
} SPI_Type;

/**
 * @} */ /* End group SPI_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'SPI0' Position & Mask macros                        ----------- */
/* -------------------------------------------------------------------------------- */

